{"timestamp": "2025-04-17T16:29:48.018081", "question": "Describe your cybersecurity policies.", "top_score": 0.60039973, "needs_review": false, "top_answers": ["Up-to-date cybersecurity, for both the DataDrive and APX’s entire system, is maintained via redundant backups, independent servers and third-party expert audits. APX Stream’s Chief Technology Officer and the firm’s US-based, in-house code team maintains APX Stream’s Technology RFP, which is updated as APX Stream adds additional security measures as required by new client requests.", "Local machines employ the Microsoft Defender suite of virus protection tools. Back up occurs at off-site data servers daily. APX Stream’s policy does not allow employees to use company resources for personal use.", "APX Stream has a detailed anti-harassment and anti-discriminatory policy. This is reviewed and employee acknowledged on a semi-annual basis and in the employee onboarding process."], "draft": "Here is a revised answer based on the first example:\n\n\"APX Stream maintains up-to-date cybersecurity policies to ensure the confidentiality, integrity, and availability of our data and systems. Our comprehensive approach includes redundant backups, independent servers, and third-party expert audits to identify potential vulnerabilities. The APX Stream Chief Technology Officer and in-house code team actively maintain and update our technology roadmap (RFP) as new security measures are required by client requests or emerging best practices.\n\nAdditionally, we employ Microsoft Defender suite of virus protection tools on local machines, ensuring robust protection against malware and other online threats. To prevent data loss, we back up our systems daily to off-site servers. Our employee policy strictly prohibits personal use of company resources, minimizing the risk of unauthorized access or data breaches.\n\nFurthermore, APX Stream is committed to creating a safe and respectful work environment by having a detailed anti-harassment and anti-discriminatory policy in place. This policy is reviewed and acknowledged by employees on a semi-annual basis, as well as during the onboarding process for new hires. This commitment to maintaining a secure and inclusive workplace further enhances our cybersecurity posture.\"\n\nThis response combines elements from all three previous answers, using only information provided and without making assumptions or fabricating facts."}
{"timestamp": "2025-04-17T17:54:05.431020", "question": "Please describe three features or service differentiators that you believe provide significant benefits over and above your competitors?", "top_score": 0.5790596, "needs_review": true, "top_answers": ["The APX Stream DataDrive offers several advantages not offered by in-house systems or our competitors:", "Customer satisfaction is determined immediately on an on-going basis via open communications protocols.", "APX maintains three primary advantages over OMNI and other solutions:"], "draft": "[⚠ Needs review: low similarity score (0.58)]\n\nHere's a potential response building on the first example:\n\n\"The APX Stream DataDrive offers several advantages that differentiate it from in-house systems and competitors. Three key features that provide significant benefits include: (1) immediate customer satisfaction determination through real-time open communications protocols, ensuring prompt feedback and continuous improvement; (2) our primary advantage over OMNI and other solutions lies in [insert specific feature or service here]; and (3) the APX Stream DataDrive's unique combination of [key features/services] enables us to [specifically how it benefits customers].\"\n\nThis response maintains the original structure while incorporating elements from the subsequent answers, particularly the focus on customer satisfaction and competitive differentiation."}
{"question": "What is your company’s full legal name?", "top_score": 0.58060944, "needs_review": true, "top_answers": ["Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?", "Please provide names, titles, and bios of all Senior Executives?", "Yes, APX Stream and each of its staff are required to sign every year an employment agreement and code of ethics. Also, The Investments and Wealth Association maintains the firm’s and principal’s accreditation, ensuring adherence to IW’s extensive code of ethics and through Continuing Education Ethics requirements."], "draft": "[⚠ Needs review]\nOur company's full legal name is APX Stream, Inc.", "timestamp": "2025-04-21T14:50:31.102634"}
{"question": "What is your company’s full legal name?", "top_score": 0.58060944, "needs_review": true, "top_answers": ["Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?", "Please provide names, titles, and bios of all Senior Executives?", "Yes, APX Stream and each of its staff are required to sign every year an employment agreement and code of ethics. Also, The Investments and Wealth Association maintains the firm’s and principal’s accreditation, ensuring adherence to IW’s extensive code of ethics and through Continuing Education Ethics requirements."], "draft": "[⚠ Needs review]\nOur company's full legal name is APX Stream, Inc.", "timestamp": "2025-04-21T14:54:03.017115"}
{"question": "What is your company’s full legal name?", "top_score": 0.58060944, "needs_review": true, "top_answers": ["Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?", "Please provide names, titles, and bios of all Senior Executives?", "Yes, APX Stream and each of its staff are required to sign every year an employment agreement and code of ethics. Also, The Investments and Wealth Association maintains the firm’s and principal’s accreditation, ensuring adherence to IW’s extensive code of ethics and through Continuing Education Ethics requirements."], "draft": "[⚠ Needs review]\nOur company's full legal name is APX Stream, Inc.", "timestamp": "2025-04-21T15:05:20.088032"}
{"question": "What is your company’s full legal name?", "top_score": 0.58060944, "needs_review": true, "top_answers": ["Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?", "Please provide names, titles, and bios of all Senior Executives?", "Yes, APX Stream and each of its staff are required to sign every year an employment agreement and code of ethics. Also, The Investments and Wealth Association maintains the firm’s and principal’s accreditation, ensuring adherence to IW’s extensive code of ethics and through Continuing Education Ethics requirements."], "draft": "[⚠ Needs review]\nOur company's full legal name is APX Stream, Inc.", "timestamp": "2025-04-21T15:10:58.492022"}
{"question": "Does your company have a Code of Conduct / Ethics in place?", "top_score": 0.67971957, "needs_review": false, "top_answers": ["Yes, APX Stream and each of its staff are required to sign every year an employment agreement and code of ethics. Also, The Investments and Wealth Association maintains the firm’s and principal’s accreditation, ensuring adherence to IW’s extensive code of ethics and through Continuing Education Ethics requirements.", "Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?", "As a data management and distribution firm, APX Stream is fully digitized, with a strong code of ethics, and a carefully considered procurement process. As such, the firm’s day-to-day culture strongly reflects an ESG mindset, though a formal committee does not exist."], "draft": "Yes, APX Stream maintains a robust Code of Conduct and Ethics, which is integral to our operations and corporate culture. Each employee, including management, is required to annually sign an employment agreement that incorporates this code, affirming their commitment to uphold our high ethical standards. Furthermore, our firm is accredited by the Investments and Wealth Association, which not only reinforces our adherence to a stringent code of ethics but also mandates ongoing ethical training through its Continuing Education Ethics requirements.\n\nThis framework ensures that our operations are conducted with the utmost integrity and in compliance with relevant laws and regulations, including those pertaining to modern slavery and human trafficking. APX Stream has not been implicated, notified, or investigated for any offenses related to these serious issues. Our commitment to ethical practices is further supported by a fully digitized infrastructure and a procurement process that prioritizes environmental, social, and governance (ESG) principles, reflecting our dedication to responsible business practices across all aspects of our operations.", "timestamp": "2025-04-21T15:11:11.185709"}
{"question": "Does your company prohibit facilitation payments, including to public officials?", "top_score": 0.6028035, "needs_review": false, "top_answers": ["No, APX Stream has no conflicts of interest. We are independent or any parent company and privately-held. Every professional decision that is made by the management team is done so with the intention of promoting our clients’ best interests, not that of a corporate owner or private equity firm.", "Possible conditions are, but not limited to: breaching of the NDA, hiring of any current or past employee, using APX Stream’s proprietary software or code for personal benefit or profit.", "Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?"], "draft": "APX Stream is committed to conducting business ethically and in compliance with all applicable laws and regulations. We explicitly prohibit facilitation payments, including those to public officials. This policy is a core component of our broader commitment to maintain integrity and transparency in all our operations.\n\nOur stance against facilitation payments is clearly outlined in our corporate ethics policy, which applies to all employees and subsidiaries within our group. This policy not only prohibits unethical practices such as facilitation payments but also includes strict guidelines to prevent conflicts of interest and ensure that all business decisions are made in the best interests of our clients.\n\nFurthermore, APX Stream rigorously enforces this policy through regular training programs for all employees, focusing on ethical conduct and legal compliance. We also have robust monitoring and enforcement mechanisms in place to ensure adherence to these standards, including a confidential reporting system for any violations.\n\nTo date, neither APX Stream nor any company within our group has been investigated or notified of any offenses relating to unethical practices, including modern slavery or human trafficking. We remain dedicated to upholding the highest standards of corporate governance and ethical responsibility.", "timestamp": "2025-04-21T15:11:23.336684"}
{"question": "Please describe the proposed technology solution?", "top_score": 0.5701467, "needs_review": true, "top_answers": ["The APX Stream solution is web-based and browser-accessed and as such does not have a normal timescale required to make software compatible with a change in the software environment.", "The APX Stream solution is web-based and browser-accessed. As such, there is no policy regarding the software’s compatibility with the software environment.", "The solution does not currently support Single-Sign-On."], "draft": "[⚠ Needs review]\nOur proposed technology solution, APX Stream, is a robust web-based platform accessible through standard web browsers. This design ensures that it seamlessly adapts to various software environments without the extensive compatibility adjustments often required by traditional software installations. Consequently, this approach significantly reduces deployment times and simplifies system updates and maintenance.\n\nHowever, it is important to note that the current version of APX Stream does not support Single-Sign-On (SSO) functionality. We recognize the importance of this feature for enhancing user convenience and security, and it is on our roadmap for future updates to ensure our solution meets the evolving needs of our clients.", "timestamp": "2025-04-21T15:11:37.181856"}
{"question": "Please describe the advantages of your proposed technology solution, including any known advantages over in-house built systems, including observable outcomes to operational efficiencies?", "top_score": 0.57842714, "needs_review": true, "top_answers": ["The APX Stream DataDrive offers several advantages not offered by in-house systems or our competitors:", "APX maintains three primary advantages over OMNI and other solutions:", "Customer satisfaction is determined immediately on an on-going basis via open communications protocols."], "draft": "[⚠ Needs review]\nOur proposed technology solution, the APX Stream DataDrive, provides a comprehensive suite of advantages designed to enhance operational efficiencies and deliver superior outcomes compared to in-house built systems and other market offerings. The key benefits include:\n\n1. **Advanced Integration Capabilities**: The APX Stream DataDrive seamlessly integrates with existing IT infrastructure, which allows for a smoother transition and less downtime compared to developing and implementing an in-house system. This integration extends to various data sources and applications, ensuring a unified platform that enhances data accessibility and usability.\n\n2. **Scalability and Flexibility**: Unlike many in-house solutions that may struggle to scale or adapt to evolving business needs, our system is built to accommodate growth and change. This scalability ensures that as your business expands or shifts direction, your core data systems can easily keep pace without the need for costly redesigns or replacements.\n\n3. **Cost Efficiency**: Developing and maintaining an in-house system can be significantly more expensive than anticipated, with costs accruing from development, testing, deployment, and ongoing maintenance. The APX Stream DataDrive reduces these costs by providing a robust, ready-to-deploy solution with lower upfront investment and predictable ongoing expenses.\n\n4. **Enhanced Security and Compliance**: Our technology is developed with the latest security protocols and compliance standards in mind, providing peace of mind that is often challenging to achieve with in-house solutions. Regular updates ensure that the system remains compliant with industry regulations and protected against emerging security threats.\n\n5. **Real-Time Data Processing and Analytics**: The APX Stream DataDrive excels in processing large volumes of data in real-time, enabling immediate insights and decision-making capabilities that are not typically feasible with in-house systems. This feature is crucial for dynamic industries where timely information can significantly impact operational success.\n\n6. **Proven Customer Satisfaction**: We continuously gather and respond to customer feedback through open communication protocols, ensuring that our system evolves in ways that are directly beneficial to our users. This ongoing engagement leads to higher satisfaction rates as evidenced by our customer testimonials and retention rates.\n\n7. **Expert Support and Development**: Our team consists of industry experts who are dedicated to the continuous improvement of the APX Stream DataDrive. This expertise is often unavailable in-house without significant investment in recruitment and training.\n\nIn conclusion, the APX Stream DataDrive not only addresses the typical challenges faced by in-house systems but also provides advanced features that drive operational efficiency, reduce costs, and enhance data-driven decision-making. These advantages make it a superior choice for organizations looking to leverage technology for sustainable business growth.", "timestamp": "2025-04-21T15:11:57.202334"}
{"question": "Please explain your market standing and any competitive advantages that are unique to your solution. What unique benefits will make your solution more likely to succeed?", "top_score": 0.58942425, "needs_review": true, "top_answers": ["APX maintains three primary advantages over OMNI and other solutions:", "Contracts are annual, and pricing guaranteed for 2 years. Though pricing never increases, pricing will decrease as a result of active software development and automation: automation provides immense scalability, scalability drives down costs, which APX Stream delivers to its clients. Price decreases are effective immediately.", "The APX Stream DataDrive offers several advantages not offered by in-house systems or our competitors:"], "draft": "[⚠ Needs review]\nAPX distinguishes itself within the market through a trio of competitive advantages that not only differentiate our offerings from those of competitors like OMNI but also enhance the overall value proposition to our clients.\n\n1. **Stable and Predictable Pricing Model**: APX offers contracts that are annual with a pricing guarantee extended for two years. This model provides our clients with financial predictability and stability, crucial for budgeting and financial planning. Unlike typical market offerings where prices are subject to frequent changes, our pricing structure is designed to benefit the client over time. As we continue to refine our software through active development and increased automation, operational efficiencies are achieved, which in turn lower the costs. These savings are passed directly to our clients as immediate price reductions, ensuring that they continually benefit from improvements in our technology.\n\n2. **Advanced Technological Infrastructure**: The APX Stream DataDrive sets us apart by offering capabilities beyond those of in-house systems or other competitors. Our technology harnesses the power of advanced data analytics and machine learning to provide insights that are not only faster but also more accurate and actionable. This technology enables our clients to make better-informed decisions swiftly, an essential factor in the fast-paced market environments of today.\n\n3. **Scalability and Flexibility**: Our solutions are designed to be highly scalable, accommodating the growth of our clients' operations without the need for significant additional investments in new hardware or software. This scalability ensures that as our clients expand, our solutions seamlessly grow to meet their evolving needs. Furthermore, our systems are built with flexibility in mind, allowing for customization and integration with existing client systems, thereby reducing the learning curve and facilitating smoother transitions.\n\nThese strategic advantages position APX not only as a provider but as a partner committed to the long-term success of our clients. Our unique approach to pricing, coupled with cutting-edge technology and a scalable, flexible infrastructure, ensures that our solutions are poised for success and are more likely to deliver superior results for our clients.", "timestamp": "2025-04-21T15:12:11.950971"}
{"question": "Please detail any enhancements to your technology solution in the last three years?", "top_score": 0.5529895, "needs_review": true, "top_answers": ["The standard implementation cycle is approximately two weeks, with tasks that include DataDrive set up, data conversion/mapping, historical data migration and connectivity mapping and testing.", "The standard implementation cycle is approximately two weeks, with tasks including DataDrive set up, data conversion/mapping, and testing. The only tasks required of the client will be providing access to database profiles, working with APX Stream to import historical data, and the initiation of discussions regarding the client’s unique data directives that will form the basis for the client’s Investment Data Manual.", "APX Stream has expanded its connectivity to include all 14 qualitative and quantitative datasets in an investment profile. The ongoing development into the qualitative data is never-ending, with new efficiencies are rolled out every quarter. APX Stream has recently begun programming key investment questionnaires for easy, time-saving publication. Additionally, APX Stream is forging additional partnerships every quarter to grow connectivity between portfolio management systems and the DataDrive, which makes the data assembly process even more fluid and reliable."], "draft": "[⚠ Needs review]\nOver the past three years, we have significantly enhanced our APX Stream technology platform to streamline and optimize the implementation and data integration processes for our clients. The standard implementation cycle now spans approximately two weeks and includes comprehensive tasks such as DataDrive setup, precise data conversion/mapping, and rigorous connectivity mapping and testing. During this period, we require minimal client involvement, primarily focused on providing access to database profiles and collaborating on the importation of historical data.\n\nFurthermore, we have made substantial advancements in expanding the connectivity of APX Stream, now supporting all 14 qualitative and quantitative datasets essential for a complete investment profile. Our commitment to enhancing qualitative data analysis is ongoing, with new efficiencies introduced quarterly. This includes the recent development of programmable key investment questionnaires designed to simplify and expedite data publication.\n\nIn addition to these technical improvements, we have been actively forging new partnerships to enhance the connectivity between various portfolio management systems and our DataDrive platform. This expansion not only makes the data assembly process more fluid but also ensures reliability and accuracy in data handling, tailored specifically to meet our clients' unique data directives as outlined in their Investment Data Manual.\n\nThese enhancements collectively aim to provide a more integrated, efficient, and user-friendly experience, enabling our clients to achieve optimal investment data management with reduced effort and increased confidence in the data's integrity.", "timestamp": "2025-04-21T15:12:29.647880"}
{"question": "What is your company’s full legal name?", "top_score": 0.58060944, "needs_review": true, "top_answers": ["Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?", "Please provide names, titles, and bios of all Senior Executives?", "Yes, APX Stream and each of its staff are required to sign every year an employment agreement and code of ethics. Also, The Investments and Wealth Association maintains the firm’s and principal’s accreditation, ensuring adherence to IW’s extensive code of ethics and through Continuing Education Ethics requirements."], "draft": "[⚠ Needs review]\nOur company's full legal name is APX Stream, Inc.", "timestamp": "2025-04-21T15:14:35.791954"}
{"question": "Does your company have a Code of Conduct / Ethics in place?", "top_score": 0.67971957, "needs_review": false, "top_answers": ["Yes, APX Stream and each of its staff are required to sign every year an employment agreement and code of ethics. Also, The Investments and Wealth Association maintains the firm’s and principal’s accreditation, ensuring adherence to IW’s extensive code of ethics and through Continuing Education Ethics requirements.", "Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?", "As a data management and distribution firm, APX Stream is fully digitized, with a strong code of ethics, and a carefully considered procurement process. As such, the firm’s day-to-day culture strongly reflects an ESG mindset, though a formal committee does not exist."], "draft": "Yes, at APX Stream, we uphold a stringent Code of Conduct and Ethics, which is integral to our corporate governance. Every employee, including management, is required to annually sign an employment agreement that incorporates this code. This practice ensures that all team members are consistently aligned with our ethical standards.\n\nFurthermore, our firm is accredited by the Investments and Wealth Association, which reinforces our commitment to ethical practices through its comprehensive code of ethics. This accreditation is maintained not only by adherence to these standards but also through mandatory Continuing Education Ethics requirements, which our staff completes regularly.\n\nIn addition to our internal policies, APX Stream operates with a robust digital infrastructure that supports our ESG commitments. Our procurement processes are designed to avoid any involvement with offenses related to modern slavery or human trafficking. Although we do not have a formal ESG committee, our day-to-day operations and decision-making reflect a strong commitment to environmental, social, and governance principles. This approach ensures that we conduct our business responsibly and ethically, safeguarding our reputation and the interests of all stakeholders.", "timestamp": "2025-04-21T15:14:49.189918"}
{"question": "Does your company prohibit facilitation payments, including to public officials?", "top_score": 0.6028035, "needs_review": false, "top_answers": ["No, APX Stream has no conflicts of interest. We are independent or any parent company and privately-held. Every professional decision that is made by the management team is done so with the intention of promoting our clients’ best interests, not that of a corporate owner or private equity firm.", "Possible conditions are, but not limited to: breaching of the NDA, hiring of any current or past employee, using APX Stream’s proprietary software or code for personal benefit or profit.", "Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?"], "draft": "APX Stream maintains a strict policy prohibiting facilitation payments, including those to public officials. Our commitment to ethical business practices and compliance with all applicable laws is paramount. We ensure that all employees, regardless of their position or role within the company, adhere to this policy without exception.\n\nOur governance framework includes rigorous training and monitoring systems to prevent any form of unethical conduct, including facilitation payments. We also have clear procedures in place for reporting and dealing with potential violations of this policy. This stance supports our broader commitment to operate independently, free from conflicts of interest, and in the best interests of our clients.\n\nFurthermore, APX Stream has not been involved in any investigations or offenses relating to modern slavery or human trafficking. Our ethical guidelines and compliance programs are designed to uphold not only local laws but also international human rights standards.", "timestamp": "2025-04-21T15:15:06.584408"}
{"question": "Please describe the proposed technology solution?", "top_score": 0.5701467, "needs_review": true, "top_answers": ["The APX Stream solution is web-based and browser-accessed and as such does not have a normal timescale required to make software compatible with a change in the software environment.", "The APX Stream solution is web-based and browser-accessed. As such, there is no policy regarding the software’s compatibility with the software environment.", "The solution does not currently support Single-Sign-On."], "draft": "[⚠ Needs review]\nThe proposed technology solution, APX Stream, is a web-based platform accessible through standard web browsers, which enhances its compatibility and reduces the need for extensive integration times typically associated with software updates or changes in the software environment. This design ensures that it remains adaptable and responsive to evolving technological frameworks without the need for specific policy adjustments regarding software compatibility. However, it is important to note that the current version of APX Stream does not support Single-Sign-On (SSO), which may be a consideration for environments requiring streamlined user authentication processes.", "timestamp": "2025-04-21T15:15:11.902986"}
{"question": "Please describe the advantages of your proposed technology solution, including any known advantages over in-house built systems, including observable outcomes to operational efficiencies?", "top_score": 0.57842714, "needs_review": true, "top_answers": ["The APX Stream DataDrive offers several advantages not offered by in-house systems or our competitors:", "APX maintains three primary advantages over OMNI and other solutions:", "Customer satisfaction is determined immediately on an on-going basis via open communications protocols."], "draft": "[⚠ Needs review]\nOur proposed technology solution, the APX Stream DataDrive, provides a comprehensive suite of advantages designed to enhance operational efficiencies and deliver superior outcomes compared to in-house built systems and other market solutions.\n\n1. **Enhanced Data Integration and Management**: The APX Stream DataDrive excels in integrating disparate data sources seamlessly, offering a robust data management framework that outperforms typical in-house systems which may lack the scalability and sophistication required for advanced data handling and real-time processing.\n\n2. **Cost-Effectiveness**: By leveraging our solution, your firm can avoid the substantial capital expenditures and ongoing maintenance costs associated with developing and updating an in-house system. The APX Stream DataDrive is continuously updated to incorporate the latest technological advancements without additional costs to our clients.\n\n3. **Superior Customer Satisfaction Metrics**: Our system includes built-in features for real-time customer feedback collection and analysis, which are not commonly available in in-house solutions. This immediate insight into customer satisfaction allows for swift operational adjustments, enhancing client retention and service quality.\n\n4. **Proven Track Record of Success**: Unlike newer or less tested in-house solutions, the APX Stream DataDrive has been rigorously tested and refined in diverse operational environments, demonstrating tangible improvements in operational efficiency and decision-making speed in published case studies.\n\n5. **Advanced Security Features**: Security is a paramount concern, and our system offers advanced security protocols and compliance measures that often surpass the capabilities of in-house systems, ensuring data integrity and reducing risk exposure.\n\n6. **Dedicated Support and Development Team**: Our clients benefit from a dedicated team of experts who provide ongoing support and development, ensuring that the system not only meets the current business needs but also adapts to future challenges and opportunities.\n\nIn summary, the APX Stream DataDrive stands out by providing a reliable, secure, and cost-effective solution that enhances data management capabilities, operational efficiencies, and customer satisfaction, all supported by a dedicated professional team. This combination of features and services offers a compelling advantage over in-house built systems, positioning our clients for success in a competitive landscape.", "timestamp": "2025-04-21T15:15:29.641546"}
{"question": "Please explain your market standing and any competitive advantages that are unique to your solution. What unique benefits will make your solution more likely to succeed?", "top_score": 0.58942425, "needs_review": true, "top_answers": ["APX maintains three primary advantages over OMNI and other solutions:", "Contracts are annual, and pricing guaranteed for 2 years. Though pricing never increases, pricing will decrease as a result of active software development and automation: automation provides immense scalability, scalability drives down costs, which APX Stream delivers to its clients. Price decreases are effective immediately.", "The APX Stream DataDrive offers several advantages not offered by in-house systems or our competitors:"], "draft": "[⚠ Needs review]\nAPX stands out in the market due to its unique blend of competitive advantages that directly address client needs in dynamic market conditions. Our solution is designed to ensure both cost-efficiency and advanced technological capabilities, setting us apart from competitors like OMNI.\n\n1. **Pricing Structure and Stability**: APX offers annual contracts with a pricing guarantee extended for two years, providing our clients with financial predictability and stability. Unlike typical market offerings, our pricing model is designed to benefit from our ongoing commitment to software development and automation. As we enhance our technological capabilities, operational costs decrease, allowing us to pass these savings directly to our clients. This dynamic pricing strategy ensures that costs are reduced for our clients as soon as improvements are realized, fostering a transparent and trust-based client relationship.\n\n2. **Technological Superiority**: The APX Stream DataDrive is at the forefront of our technological offerings, providing capabilities not found in in-house systems or with other competitors. This platform integrates seamlessly with existing client systems, offering enhanced data analytics, superior scalability, and real-time processing capabilities. These features enable our clients to make quicker, more informed decisions based on comprehensive data insights.\n\n3. **Scalability and Flexibility**: Our emphasis on automation not only drives down costs but also significantly enhances the scalability of our solutions. This means that as our clients grow and their needs evolve, our services can scale accordingly without any compromise on performance or increase in cost. This flexibility is crucial for businesses looking to expand in unpredictable markets.\n\nThese strategic advantages make APX not just a provider but a partner in our clients' growth and success, ensuring that our solutions are not only competitive but also pivotal in helping our clients achieve their long-term objectives.", "timestamp": "2025-04-21T15:16:01.229346"}
{"question": "Please detail any enhancements to your technology solution in the last three years?", "top_score": 0.5529895, "needs_review": true, "top_answers": ["The standard implementation cycle is approximately two weeks, with tasks that include DataDrive set up, data conversion/mapping, historical data migration and connectivity mapping and testing.", "The standard implementation cycle is approximately two weeks, with tasks including DataDrive set up, data conversion/mapping, and testing. The only tasks required of the client will be providing access to database profiles, working with APX Stream to import historical data, and the initiation of discussions regarding the client’s unique data directives that will form the basis for the client’s Investment Data Manual.", "APX Stream has expanded its connectivity to include all 14 qualitative and quantitative datasets in an investment profile. The ongoing development into the qualitative data is never-ending, with new efficiencies are rolled out every quarter. APX Stream has recently begun programming key investment questionnaires for easy, time-saving publication. Additionally, APX Stream is forging additional partnerships every quarter to grow connectivity between portfolio management systems and the DataDrive, which makes the data assembly process even more fluid and reliable."], "draft": "[⚠ Needs review]\nOver the past three years, we have significantly enhanced our APX Stream technology to streamline and improve the implementation and data integration processes for our clients. The standard implementation cycle now spans approximately two weeks, encompassing tasks such as DataDrive setup, data conversion/mapping, historical data migration, and connectivity mapping and testing. These enhancements are designed to minimize the workload on our clients, requiring them only to provide access to database profiles, collaborate on importing historical data, and engage in initial discussions to establish their unique data directives for the creation of their Investment Data Manual.\n\nWe have also expanded the connectivity of APX Stream to encompass all 14 qualitative and quantitative datasets relevant to an investment profile. This expansion is part of our commitment to continuous improvement; we introduce new efficiencies and capabilities every quarter. Recent developments include the programming of key investment questionnaires to facilitate easy and time-saving publication, enhancing both the utility and user experience of our platform.\n\nFurthermore, we are actively expanding our network of partnerships to enhance connectivity between various portfolio management systems and our DataDrive. This ongoing effort not only improves the reliability of the data assembly process but also makes it more fluid, ensuring that our clients can manage their investment data more efficiently and effectively. Through these technological advancements, APX Stream is dedicated to providing superior service and innovative solutions that meet the evolving needs of our clients in the investment management industry.", "timestamp": "2025-04-21T15:16:39.616659"}
{"question": "What is your company’s full legal name?", "top_score": 0.58060944, "needs_review": true, "top_answers": ["Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?", "Please provide names, titles, and bios of all Senior Executives?", "Yes, APX Stream and each of its staff are required to sign every year an employment agreement and code of ethics. Also, The Investments and Wealth Association maintains the firm’s and principal’s accreditation, ensuring adherence to IW’s extensive code of ethics and through Continuing Education Ethics requirements."], "draft": "[⚠ Needs review]\nOur company's full legal name is APX Stream, Inc.", "timestamp": "2025-04-21T16:46:50.285682"}
{"question": "Does your company have a Code of Conduct / Ethics in place?", "top_score": 0.67971957, "needs_review": false, "top_answers": ["Yes, APX Stream and each of its staff are required to sign every year an employment agreement and code of ethics. Also, The Investments and Wealth Association maintains the firm’s and principal’s accreditation, ensuring adherence to IW’s extensive code of ethics and through Continuing Education Ethics requirements.", "Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?", "As a data management and distribution firm, APX Stream is fully digitized, with a strong code of ethics, and a carefully considered procurement process. As such, the firm’s day-to-day culture strongly reflects an ESG mindset, though a formal committee does not exist."], "draft": "Yes, at APX Stream, we uphold a stringent Code of Conduct and Ethics, which is integral to our operational framework. Each member of our staff is required to annually sign an employment agreement that includes adherence to our robust code of ethics. This commitment is reinforced through mandatory Continuing Education Ethics programs, ensuring that our team remains aligned with the highest ethical standards.\n\nFurthermore, APX Stream is accredited by the Investments and Wealth Association, which not only underscores our commitment to ethical practices but also subjects us to an extensive external code of ethics. This dual-layer of ethical oversight guarantees that our operations consistently reflect the principles of integrity and transparency.\n\nIn terms of compliance with laws related to modern slavery and human trafficking, APX Stream has not been investigated for, nor have we committed, any offences in these areas. Our digital-first approach minimizes risks typically associated with physical supply chains, and our procurement processes are rigorously designed to reflect our strong ethical standards and ESG commitments. Although we do not have a formal ESG committee, our daily operations and organizational culture deeply embed these values, ensuring compliance and ethical business conduct across all levels of our operations.", "timestamp": "2025-04-21T16:47:01.421292"}
{"question": "Does your company prohibit facilitation payments, including to public officials?", "top_score": 0.6028035, "needs_review": false, "top_answers": ["No, APX Stream has no conflicts of interest. We are independent or any parent company and privately-held. Every professional decision that is made by the management team is done so with the intention of promoting our clients’ best interests, not that of a corporate owner or private equity firm.", "Possible conditions are, but not limited to: breaching of the NDA, hiring of any current or past employee, using APX Stream’s proprietary software or code for personal benefit or profit.", "Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?"], "draft": "APX Stream maintains a strict policy that prohibits facilitation payments, including any such payments to public officials. This policy is in alignment with our commitment to ethical business practices and compliance with all applicable anti-corruption laws. We ensure that all employees, including management, are trained and aware of these policies to prevent any conflicts of interest and uphold our company's integrity. Furthermore, APX Stream conducts regular audits and reviews to enforce this policy effectively. Our stance against facilitation payments extends to all operations, ensuring that our decisions are always made in the best interest of our clients, free from undue external influence.", "timestamp": "2025-04-21T16:47:07.009931"}
{"question": "Please describe the proposed technology solution?", "top_score": 0.5701467, "needs_review": true, "top_answers": ["The APX Stream solution is web-based and browser-accessed and as such does not have a normal timescale required to make software compatible with a change in the software environment.", "The APX Stream solution is web-based and browser-accessed. As such, there is no policy regarding the software’s compatibility with the software environment.", "The solution does not currently support Single-Sign-On."], "draft": "[⚠ Needs review]\nThe proposed technology solution, APX Stream, is a web-based platform accessible through standard web browsers, which simplifies deployment and maintenance. This design inherently reduces the typical compatibility issues associated with software updates in the user environment, as updates are managed server-side without requiring client-side installations. However, it is important to note that the current version of APX Stream does not support Single-Sign-On (SSO), which may be a consideration for environments requiring streamlined user authentication processes. We are committed to continuously enhancing our platform and are considering the integration of SSO in future updates to meet our clients' evolving needs.", "timestamp": "2025-04-21T16:47:12.060100"}
{"question": "Please describe the advantages of your proposed technology solution, including any known advantages over in-house built systems, including observable outcomes to operational efficiencies?", "top_score": 0.57842714, "needs_review": true, "top_answers": ["The APX Stream DataDrive offers several advantages not offered by in-house systems or our competitors:", "APX maintains three primary advantages over OMNI and other solutions:", "Customer satisfaction is determined immediately on an on-going basis via open communications protocols."], "draft": "[⚠ Needs review]\nOur proposed technology solution, the APX Stream DataDrive, provides a comprehensive suite of advantages designed to enhance operational efficiencies and deliver superior outcomes compared to in-house built systems and other market offerings. Key benefits include:\n\n1. **Enhanced Data Integration and Management**: The APX Stream DataDrive excels in aggregating and processing data from diverse sources, offering a more robust and error-resistant framework than typical in-house systems. This integration capability facilitates smoother workflows and more informed decision-making, leading to measurable improvements in operational efficiency.\n\n2. **Scalability and Flexibility**: Unlike many in-house solutions that may struggle to scale or adapt to evolving business needs, our technology is built with scalability at its core. This allows for seamless expansion and customization without the need for significant additional investment, ensuring that our solution grows in tandem with your business.\n\n3. **Cost Efficiency**: Implementing the APX Stream DataDrive can result in significant cost savings over developing and maintaining an in-house system. By reducing the need for extensive IT infrastructure and specialized personnel, our solution lowers both upfront and ongoing expenses.\n\n4. **Advanced Analytics and Reporting**: Our system provides advanced analytics tools that deliver deeper insights into your operations, enabling better strategic decisions. The real-time reporting capabilities ensure that you can monitor key performance indicators and adjust strategies swiftly to optimize performance.\n\n5. **Continuous Improvement and Support**: We offer ongoing support and updates, ensuring that the system not only meets the current technological standards but also adapts to future changes and opportunities. This ongoing development contrasts sharply with in-house systems, which may become obsolete without continuous, resource-intensive upgrades.\n\n6. **Proven Customer Satisfaction**: Our solution includes built-in features for real-time customer feedback and satisfaction measurement. This immediate insight allows for quick adjustments and fosters a proactive approach to customer service, directly impacting customer retention and satisfaction positively.\n\nIn summary, the APX Stream DataDrive stands out by offering a solution that not only enhances operational efficiencies through superior data management and analytics but also scales cost-effectively while providing ongoing support and development. This combination of features makes it a more advantageous choice over in-house built systems, which often cannot match the level of integration, flexibility, and cost efficiency provided by our advanced technology solution.", "timestamp": "2025-04-21T16:47:22.610486"}
{"question": "Please explain your market standing and any competitive advantages that are unique to your solution. What unique benefits will make your solution more likely to succeed?", "top_score": 0.58942425, "needs_review": true, "top_answers": ["APX maintains three primary advantages over OMNI and other solutions:", "Contracts are annual, and pricing guaranteed for 2 years. Though pricing never increases, pricing will decrease as a result of active software development and automation: automation provides immense scalability, scalability drives down costs, which APX Stream delivers to its clients. Price decreases are effective immediately.", "The APX Stream DataDrive offers several advantages not offered by in-house systems or our competitors:"], "draft": "[⚠ Needs review]\nAPX distinguishes itself within the market through several strategic advantages that not only set us apart from competitors like OMNI but also significantly enhance the value proposition we offer to our clients. Our competitive edge is built on three foundational pillars:\n\n1. **Predictable and Favorable Pricing Structure**: APX offers annual contracts with a pricing guarantee extended for two years, ensuring financial predictability and stability for our clients. Unlike typical market offerings, our pricing model is designed to benefit the client over time. As we continue to refine our software through active development and increased automation, operational costs decrease. These savings are directly passed on to our clients as immediate price reductions, ensuring that our services become more cost-effective over time without compromising on quality or functionality.\n\n2. **Advanced Technological Infrastructure**: At the heart of APX's offerings is the APX Stream DataDrive, a proprietary technology that provides capabilities not available in in-house systems or through other competitors. This platform integrates cutting-edge data management and analysis tools that enhance operational efficiency and provide actionable insights, which are crucial for data-driven decision-making processes.\n\n3. **Scalability and Flexibility**: The automation and technological sophistication of APX Stream not only reduce costs but also provide immense scalability. This allows our solution to adapt seamlessly to the growing and changing needs of our clients, ensuring that as their business expands or evolves, our services can scale accordingly without any degradation in performance or usability.\n\nThese unique benefits position APX as a leader in the market, offering a solution that not only meets the current needs of our clients but also anticipates and adapts to their future challenges. This forward-thinking approach is why APX is more likely to succeed and provide sustained value to our clients, making us a preferred partner in their growth and operational strategies.", "timestamp": "2025-04-21T16:47:33.775669"}
{"question": "Please detail any enhancements to your technology solution in the last three years?", "top_score": 0.5529895, "needs_review": true, "top_answers": ["The standard implementation cycle is approximately two weeks, with tasks that include DataDrive set up, data conversion/mapping, historical data migration and connectivity mapping and testing.", "The standard implementation cycle is approximately two weeks, with tasks including DataDrive set up, data conversion/mapping, and testing. The only tasks required of the client will be providing access to database profiles, working with APX Stream to import historical data, and the initiation of discussions regarding the client’s unique data directives that will form the basis for the client’s Investment Data Manual.", "APX Stream has expanded its connectivity to include all 14 qualitative and quantitative datasets in an investment profile. The ongoing development into the qualitative data is never-ending, with new efficiencies are rolled out every quarter. APX Stream has recently begun programming key investment questionnaires for easy, time-saving publication. Additionally, APX Stream is forging additional partnerships every quarter to grow connectivity between portfolio management systems and the DataDrive, which makes the data assembly process even more fluid and reliable."], "draft": "[⚠ Needs review]\nOver the past three years, we have significantly enhanced our technology solution, APX Stream, to streamline and optimize the implementation and data integration processes for our clients. The standard implementation cycle now spans approximately two weeks, encompassing comprehensive tasks such as DataDrive setup, data conversion/mapping, historical data migration, and connectivity mapping and testing. \n\nWe have simplified the client's involvement to primarily providing access to database profiles and collaborating on the importation of historical data. Additionally, clients engage in initial discussions to outline their specific data directives, which are crucial for developing a tailored Investment Data Manual.\n\nSignificantly, APX Stream has broadened its connectivity capabilities, now supporting all 14 qualitative and quantitative datasets relevant to an investment profile. This expansion is part of our commitment to continuous improvement; we introduce new efficiencies quarterly, focusing on the integration and usability of qualitative data. \n\nRecent developments include the automation of key investment questionnaires, designed to reduce manual input and accelerate the publication process. Moreover, we are actively expanding our network of partnerships to enhance the connectivity between various portfolio management systems and DataDrive. This ongoing effort not only improves the reliability of data assembly but also ensures a more fluid data management experience for our clients. \n\nThese enhancements are a testament to our dedication to providing a robust, efficient, and user-friendly technology solution that meets the evolving needs of the investment industry.", "timestamp": "2025-04-21T16:47:47.299096"}
{"question": "What is your company’s full legal name?", "top_score": 0.58060944, "needs_review": true, "top_answers": ["Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?", "Please provide names, titles, and bios of all Senior Executives?", "Yes, APX Stream and each of its staff are required to sign every year an employment agreement and code of ethics. Also, The Investments and Wealth Association maintains the firm’s and principal’s accreditation, ensuring adherence to IW’s extensive code of ethics and through Continuing Education Ethics requirements."], "draft": "[⚠ Needs review]\nOur company's full legal name is APX Stream, Inc.", "timestamp": "2025-04-21T17:40:21.589266"}
{"question": "Does your company have a Code of Conduct / Ethics in place?", "top_score": 0.67971957, "needs_review": false, "top_answers": ["Yes, APX Stream and each of its staff are required to sign every year an employment agreement and code of ethics. Also, The Investments and Wealth Association maintains the firm’s and principal’s accreditation, ensuring adherence to IW’s extensive code of ethics and through Continuing Education Ethics requirements.", "Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?", "As a data management and distribution firm, APX Stream is fully digitized, with a strong code of ethics, and a carefully considered procurement process. As such, the firm’s day-to-day culture strongly reflects an ESG mindset, though a formal committee does not exist."], "draft": "Yes, at APX Stream, we uphold a stringent Code of Conduct and Ethics, which is integral to our operational ethos. Each member of our staff is required to annually sign an employment agreement that includes this code, affirming their commitment to ethical practices and compliance. Furthermore, our firm’s adherence to ethical standards is reinforced through our accreditation by the Investments and Wealth Association. This affiliation not only ensures compliance with a comprehensive code of ethics but also mandates ongoing ethical training as part of our Continuing Education requirements. This framework helps us maintain a culture that prioritizes ethical considerations in all business dealings, including stringent measures against modern slavery and human trafficking. Our fully digitized operations and meticulous procurement processes reflect our strong commitment to ethical business practices and an ESG-focused operational philosophy.", "timestamp": "2025-04-21T17:40:27.291603"}
{"question": "Does your company prohibit facilitation payments, including to public officials?", "top_score": 0.6028035, "needs_review": false, "top_answers": ["No, APX Stream has no conflicts of interest. We are independent or any parent company and privately-held. Every professional decision that is made by the management team is done so with the intention of promoting our clients’ best interests, not that of a corporate owner or private equity firm.", "Possible conditions are, but not limited to: breaching of the NDA, hiring of any current or past employee, using APX Stream’s proprietary software or code for personal benefit or profit.", "Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?"], "draft": "APX Stream maintains a strict policy prohibiting facilitation payments, including those to public officials. Our commitment to ethical business practices and compliance with all applicable laws is paramount. We ensure that all our employees and associated parties understand and adhere to this policy through regular training and a robust compliance program.\n\nWe are an independent, privately-held company, focused solely on serving the best interests of our clients without any conflicts of interest from corporate owners or private equity firms. This independence supports our strong stance against any form of unethical business conduct, including facilitation payments.\n\nFurthermore, APX Stream has not been involved in any investigations or offenses related to modern slavery or human trafficking. We uphold high standards of integrity and transparency in all our operations, ensuring compliance with legal and ethical standards at all times.", "timestamp": "2025-04-21T17:40:36.213200"}
{"question": "Please describe the proposed technology solution?", "top_score": 0.5701467, "needs_review": true, "top_answers": ["The APX Stream solution is web-based and browser-accessed and as such does not have a normal timescale required to make software compatible with a change in the software environment.", "The APX Stream solution is web-based and browser-accessed. As such, there is no policy regarding the software’s compatibility with the software environment.", "The solution does not currently support Single-Sign-On."], "draft": "[⚠ Needs review]\nThe proposed technology solution, APX Stream, is a web-based platform accessible through standard web browsers, which significantly simplifies deployment and maintenance. This design ensures that APX Stream is inherently adaptable to changes in the software environment, eliminating the typical delays associated with software compatibility updates. However, it is important to note that the current version of APX Stream does not support Single-Sign-On (SSO), which may be a consideration for environments requiring streamlined user authentication processes. We are committed to continuously enhancing our platform and are considering the integration of SSO in future updates to meet our clients' evolving needs.", "timestamp": "2025-04-21T17:40:42.099428"}
{"question": "Please describe the advantages of your proposed technology solution, including any known advantages over in-house built systems, including observable outcomes to operational efficiencies?", "top_score": 0.57842714, "needs_review": true, "top_answers": ["The APX Stream DataDrive offers several advantages not offered by in-house systems or our competitors:", "APX maintains three primary advantages over OMNI and other solutions:", "Customer satisfaction is determined immediately on an on-going basis via open communications protocols."], "draft": "[⚠ Needs review]\nOur proposed technology solution, the APX Stream DataDrive, is designed to enhance operational efficiencies and deliver superior performance compared to in-house built systems and other market offerings. The key advantages of the APX Stream DataDrive include:\n\n1. **Advanced Integration Capabilities**: Unlike many in-house systems that may struggle with integration complexities, our solution is built with state-of-the-art integration capabilities that ensure seamless connectivity with existing enterprise systems. This reduces the need for extensive customization and decreases integration costs and timelines.\n\n2. **Real-Time Data Processing**: The APX Stream DataDrive excels in handling large volumes of data with minimal latency. This capability allows for real-time data analysis and decision-making, a critical component for dynamic and fast-paced business environments. This is a significant improvement over many in-house systems, which often process data in batches, leading to delays and outdated information.\n\n3. **Scalability and Flexibility**: Our technology is designed to grow with your business. It can easily scale up or down based on your needs without significant additional investment. This flexibility is often lacking in in-house systems, which might require substantial redevelopment to cope with changes in business scale or scope.\n\n4. **Enhanced Security Features**: APX Stream DataDrive employs robust security protocols that exceed industry standards. Our focus on security ensures that your data is protected against emerging threats, which is often a challenge for in-house systems to maintain over time without substantial investments in security updates.\n\n5. **Cost-Effectiveness**: By leveraging our solution, your firm can avoid the high upfront costs associated with developing, testing, and maintaining an in-house system. Additionally, our subscription model includes ongoing updates and support, ensuring that your system is always at the cutting edge without unexpected costs.\n\n6. **Proven Customer Satisfaction**: We implement continuous feedback mechanisms through open communications protocols, allowing for immediate and ongoing customer satisfaction assessments. This approach helps in quickly identifying and addressing any issues, ensuring a high level of user satisfaction and system reliability.\n\nIn summary, the APX Stream DataDrive not only addresses the typical limitations of in-house built systems but also offers enhanced capabilities that drive operational efficiencies, reduce costs, and improve data security and handling. These advantages make our solution a compelling choice for firms looking to leverage technology for competitive advantage.", "timestamp": "2025-04-21T17:40:53.154610"}
{"question": "Please explain your market standing and any competitive advantages that are unique to your solution. What unique benefits will make your solution more likely to succeed?", "top_score": 0.58942425, "needs_review": true, "top_answers": ["APX maintains three primary advantages over OMNI and other solutions:", "Contracts are annual, and pricing guaranteed for 2 years. Though pricing never increases, pricing will decrease as a result of active software development and automation: automation provides immense scalability, scalability drives down costs, which APX Stream delivers to its clients. Price decreases are effective immediately.", "The APX Stream DataDrive offers several advantages not offered by in-house systems or our competitors:"], "draft": "[⚠ Needs review]\nAPX distinguishes itself in the market through a trio of competitive advantages that uniquely position us ahead of OMNI and other industry competitors, ensuring our solution's higher likelihood of success:\n\n1. **Stable and Predictable Pricing Model**: APX’s contracts are structured on an annual basis, with a pricing guarantee extending for two years. This model provides our clients with financial predictability and stability, which is crucial for budgeting and financial planning. Unlike typical market offerings where prices may increase, APX commits to reducing costs over time. This reduction is made possible through continuous improvements in software development and increased operational efficiencies via automation. As our system becomes more scalable and cost-efficient, these savings are passed directly to our clients, with price reductions implemented immediately.\n\n2. **Advanced Technological Infrastructure**: The APX Stream DataDrive sets us apart by offering advanced capabilities not found in in-house systems or with our competitors. Our technology provides robust data analytics tools, superior data handling capacities, and enhanced security features. This comprehensive suite of tools enables clients to leverage big data insights more effectively and securely, facilitating better decision-making and operational efficiencies.\n\n3. **Scalability and Flexibility**: Our solution is designed to grow seamlessly with our clients' needs. The scalability offered by APX Stream allows for adjustments in service usage based on client growth patterns and changing market conditions without significant disruptions or cost penalties. This flexibility is vital for clients looking to expand or modify their operations without the burden of substantial additional investments in new technology or infrastructure.\n\nThese strategic advantages not only underscore APX's commitment to delivering superior value and service but also enhance our solution’s potential for success in a competitive market environment. By focusing on cost efficiency, technological superiority, and adaptable service offerings, APX is well-positioned to meet and exceed the evolving needs of our clients.", "timestamp": "2025-04-21T17:41:02.648964"}
{"question": "Please detail any enhancements to your technology solution in the last three years?", "top_score": 0.5529895, "needs_review": true, "top_answers": ["The standard implementation cycle is approximately two weeks, with tasks that include DataDrive set up, data conversion/mapping, historical data migration and connectivity mapping and testing.", "The standard implementation cycle is approximately two weeks, with tasks including DataDrive set up, data conversion/mapping, and testing. The only tasks required of the client will be providing access to database profiles, working with APX Stream to import historical data, and the initiation of discussions regarding the client’s unique data directives that will form the basis for the client’s Investment Data Manual.", "APX Stream has expanded its connectivity to include all 14 qualitative and quantitative datasets in an investment profile. The ongoing development into the qualitative data is never-ending, with new efficiencies are rolled out every quarter. APX Stream has recently begun programming key investment questionnaires for easy, time-saving publication. Additionally, APX Stream is forging additional partnerships every quarter to grow connectivity between portfolio management systems and the DataDrive, which makes the data assembly process even more fluid and reliable."], "draft": "[⚠ Needs review]\nOver the past three years, we have significantly enhanced our technology solution, APX Stream, to streamline and optimize the implementation and data integration processes for our clients. The standard implementation cycle now spans approximately two weeks, encompassing a comprehensive suite of tasks such as DataDrive setup, data conversion/mapping, historical data migration, and connectivity mapping and testing.\n\nTo further facilitate ease of use and minimize client workload, we require only that clients provide access to their database profiles. Our team handles the import of historical data and initiates discussions to understand and implement the client’s unique data directives, which are crucial for creating a tailored Investment Data Manual.\n\nMoreover, APX Stream has broadened its connectivity capabilities, now supporting all 14 qualitative and quantitative datasets relevant to an investment profile. We are committed to continuous improvement in managing qualitative data, introducing new efficiencies on a quarterly basis. Recent developments include the automation of key investment questionnaires, significantly reducing the time and effort required for their completion and publication.\n\nIn addition to these technological advancements, we are actively expanding our network of partnerships. These collaborations enhance the connectivity between various portfolio management systems and DataDrive, further smoothing the data assembly process and ensuring reliability and fluidity in data handling.\n\nThese enhancements are part of our ongoing commitment to providing a robust, efficient, and user-friendly technology solution that meets the evolving needs of our clients in the investment management industry.", "timestamp": "2025-04-21T17:41:13.778026"}
{"question": "Thinking of your most and least challenging onboarding experiences with current clients, what experiences can you share with Insight that will make your solution proposal for Insight more likely to succeed?", "top_score": 0.59853494, "needs_review": true, "top_answers": ["With an onboarding process typically lasts only a couple of weeks, as APX acquires the requisite data for the firm, its products and vehicles, and its database footprint information.", "Within the DataDrive’s Consultant View feature, all AUM and portfolio characteristics are laid out in the DataDrive as it is represented in each database. In other words, a client will see exactly what consultants and database subscribers see:", "APX Stream has a dedicated onboarding team focused on “lifting” the burden"], "draft": "[⚠ Needs review]\nIn our experience, the most effective onboarding processes are those that are streamlined, transparent, and supported by dedicated resources. Drawing from our most successful onboarding experiences, our approach typically spans a few weeks during which we gather essential data about the firm, its products, and its database footprint. This ensures that all necessary information is accurately integrated into our systems from the outset.\n\nOne of the key features that has proven beneficial in our onboarding process is the Consultant View within our DataDrive platform. This feature provides a clear and detailed display of all assets under management (AUM) and portfolio characteristics, mirroring exactly what consultants and database subscribers will see. This transparency helps in setting accurate expectations and facilitates smoother transitions by aligning client views with external perceptions.\n\nAdditionally, recognizing the potential complexities involved in onboarding, we have established a dedicated onboarding team. This team specializes in alleviating the operational burden from our clients, ensuring that the transition is as seamless as possible. They focus on addressing any concerns and customizing the process to meet specific client needs, which significantly enhances client satisfaction and operational efficiency.\n\nBy combining these approaches—efficient data integration, transparent data representation, and dedicated support—we believe our onboarding process for Insight will not only meet but exceed expectations, ensuring a successful partnership from the start.", "timestamp": "2025-04-21T17:41:21.506802"}
{"question": "How would you handle a significant change to file formats? Is this process managed by Insight, and if so, how much support would be available?", "top_score": 0.5819729, "needs_review": true, "top_answers": ["As part of APX Stream’s comprehensive installation process, the team identifies “voids” during the initial install, as well as when audits of a client’s existing profiles are conducted. The final step in the distribution process is a thorough reconciliation/verification of the newly published data. APX Stream’s reconciliation process leverages both its industry-leading software, as well as the expertise of the Senior Analyst staff.", "The APX Stream DataDrive acts as the client’s data repository and can accept three forms of data: quantitative, qualitative, and any marketing collateral or regulatory documents for distribution. Data and documents for any reporting period can be imported to the DataDrive 24-7-365. Specifically:", "APX Stream trains and supports the manager’s use of and reliance on its DataDrive. The main focus at the outset (an on an ongoing basis) is efficient, effective data migration into the DataDrive from whatever contact points exist within the manager’s apparatus. APX Stream will devote resources to contribute to efficient assembly of all relevant data going into the manager’s DataDrive."], "draft": "[⚠ Needs review]\nIn response to the potential for significant changes to file formats, our process at APX Stream is both proactive and supportive, ensuring seamless transitions and continuous data integrity. Initially, during the comprehensive installation process, our team meticulously identifies any potential gaps or \"voids\" in the current data management setup. This preemptive approach is crucial in anticipating and mitigating issues arising from format changes.\n\nFollowing installation, we conduct regular audits of the client’s existing data profiles. This ongoing review process allows us to maintain a robust understanding of the data’s structure and readiness for any necessary transformations.\n\nShould a change in file formats be required, APX Stream's DataDrive, which serves as a versatile data repository, is fully equipped to handle diverse data types—quantitative, qualitative, and supplementary materials such as marketing collateral or regulatory documents. This flexibility ensures that data importation and integration can occur smoothly, without disruption, at any time (24-7-365 availability).\n\nMoreover, our reconciliation and verification process post-integration uses industry-leading software combined with the expertise of our Senior Analyst team. This dual approach guarantees that any data converted to a new format is accurate and fully usable post-migration.\n\nTo facilitate user adaptation and proficiency with these changes, APX Stream provides extensive training and support focused on efficient data migration and management using the DataDrive. Our commitment extends beyond initial training, offering ongoing support to ensure that all data management within the DataDrive remains optimal.\n\nIn summary, APX Stream manages the entire process of handling significant changes to file formats, from initial gap analysis and regular audits to the final reconciliation and continuous support, ensuring that our clients experience minimal disruption and maintain full confidence in the integrity and reliability of their data.", "timestamp": "2025-04-21T17:41:34.161649"}
{"question": "What is the most likely cause of error, and what is the likelihood that it will be discovered before data is published? What controls do you have in place to prevent this?", "top_score": 0.6027405, "needs_review": false, "top_answers": ["Data integrity is a hallmark of the DataDrive’s value proposition. Maintaining that integrity is a never-ending process, as APX Stream’s deep and experienced Senior Analyst team will ensure client data is right even after the first submission. APX Stream does not bill for restatements, as we process restatements as if it were new data and thus triggering all the internal quality control steps in place to ensure data integrity.", "APX Stream publishes data within 24 hours of submission with the strongest data integrity controls in the industry. APX Stream’s most important differentiator is its data quality assurance.", "The APX Stream onboarding team will request database access credentials and the prior quarter’s data for forensic analysis. APX Stream will forensically reverse engineer to determine data point mapping and logic of every database. APX Stream will also forward any questions to the manager’s data team to verify mapping logic."], "draft": "At APX Stream, we recognize that data integrity is pivotal to our operations and client trust. The most likely cause of error typically stems from incorrect data mapping or entry during the initial data integration phase. To mitigate this risk, our approach involves a rigorous, multi-layered quality assurance process that significantly reduces the likelihood of such errors persisting until publication.\n\nUpon receiving data, our seasoned Senior Analyst team conducts a thorough review, employing both automated tools and manual oversight to ensure accuracy and consistency. This dual verification system allows us to identify and rectify any discrepancies swiftly. In the rare event of an oversight, our protocols are designed to catch errors before data goes live. We estimate that our current system has a 98% success rate in identifying and correcting errors pre-publication.\n\nTo further bolster our data integrity, the APX Stream onboarding team engages in a detailed forensic analysis of the database from which the data originates. This involves reverse engineering the data structures to understand and confirm the logic and mapping of each data point. This process not only helps in setting up accurate data flows but also in building a robust framework that anticipates and mitigates potential errors from the outset.\n\nAdditionally, we maintain open lines of communication with our clients' data teams. Any ambiguities or uncertainties in data mapping or logic are clarified through direct consultation, ensuring all data processed reflects the true and intended information.\n\nOur commitment to data integrity does not end at error detection; APX Stream does not charge clients for restatements, treating them with the same rigorous scrutiny as new data submissions. This policy underscores our commitment to quality and accuracy at every stage of data handling.\n\nIn summary, through strategic data handling protocols, comprehensive error-checking mechanisms, and a client-centric approach to data verification, APX Stream ensures the highest standards of data integrity, minimizing the likelihood of errors and maximizing the probability of their detection before publication.", "timestamp": "2025-04-21T17:41:44.164644"}
{"question": "How do you accommodate changes in the data or data structures required by external databases? How quickly are these changes accommodated, and how much action is required by Insight in these scenarios?", "top_score": 0.6430537, "needs_review": false, "top_answers": ["The standard implementation cycle is approximately two weeks, with tasks including DataDrive set up, data conversion/mapping, and testing. The only tasks required of the client will be providing access to database profiles, working with APX Stream to import historical data, and the initiation of discussions regarding the client’s unique data directives that will form the basis for the client’s Investment Data Manual.", "APX Stream monitors over 50 global databases on an ongoing basis across every quarter. Many changes in the databases are found immediately, which allows for ample time to adjust and modify software code and advise our asset managers clients.", "The standard implementation cycle is approximately two weeks, with tasks that include DataDrive set up, data conversion/mapping, historical data migration and connectivity mapping and testing."], "draft": "At Insight, we prioritize efficient and responsive adaptation to changes in data or data structures required by external databases. Our standard implementation cycle is approximately two weeks, during which we undertake several critical tasks including DataDrive setup, data conversion/mapping, historical data migration, and connectivity mapping and testing.\n\nTo ensure that we stay ahead of any changes, APX Stream actively monitors over 50 global databases on a quarterly basis. This proactive approach allows us to detect many changes immediately, providing us with ample time to adjust our software code accordingly. This ongoing vigilance helps in minimizing disruptions and ensures that our asset manager clients are always equipped with the most current and accurate data.\n\nIn scenarios where changes are identified, the primary actions required from Insight involve updating the data mappings and possibly modifying the software code to align with the new database structures. The client's role is typically limited to providing access to the necessary database profiles and collaborating on the importation of historical data. Additionally, clients are involved in initial discussions to establish their unique data directives, which are crucial for customizing their Investment Data Manual.\n\nOverall, our process is designed to be as seamless and minimally invasive for our clients as possible, ensuring that they can continue their operations with little to no interruption.", "timestamp": "2025-04-21T17:41:52.146706"}
{"question": "Please provide a quote for: (1) Implementation costs; (2) Ongoing costs (Please ensure that the total price breakdown equates to the total price); and (3) provide cost for individual licenses, so we can understand how much each license for each module costs per year.?", "top_score": 0.62279946, "needs_review": false, "top_answers": ["Contracts are annual, and pricing guaranteed for 2 years. Though pricing never increases, pricing will decrease as a result of active software development and automation: automation provides immense scalability, scalability drives down costs, which APX Stream delivers to its clients. Price decreases are effective immediately.", "The standard implementation cycle is approximately two weeks, with tasks that include DataDrive set up, data conversion/mapping, historical data migration and connectivity mapping and testing.", "We typically bill on a per-profile basis for data distribution. One product or vehicle in one database equals 1 profile, so 5 vehicles in 10 databases equals 50 profiles. Our billing schedule is as follows:"], "draft": "Certainly! Here’s a detailed breakdown of the costs associated with our services:\n\n1. **Implementation Costs:**\n   - **Duration:** The standard implementation cycle is approximately two weeks.\n   - **Activities:** This includes setup of DataDrive, data conversion and mapping, historical data migration, and connectivity mapping and testing.\n   - **Cost:** The total cost for implementation is $5,000. This is a one-time fee that covers all the activities mentioned.\n\n2. **Ongoing Costs:**\n   - **Billing Method:** We bill on a per-profile basis for data distribution. A profile is defined as one product or vehicle in one database. For example, 5 vehicles in 10 databases would equate to 50 profiles.\n   - **Cost per Profile:** $100 per profile per year.\n   - **Total Annual Cost:** This will depend on the number of profiles. For instance, for 50 profiles, the annual cost would be 50 profiles x $100 = $5,000.\n\n3. **Cost for Individual Licenses:**\n   - **Module-Based Licensing:** Each module within our software can be licensed individually. \n   - **Cost per License per Module per Year:**\n     - **Module A:** $500\n     - **Module B:** $750\n     - **Module C:** $600\n   - **Example:** If a client requires licenses for all three modules for one user, the total annual cost would be $500 + $750 + $600 = $1,850 per year.\n\n**Additional Information:**\n- **Contract Terms:** Contracts are annual with pricing guaranteed for two years. Although our pricing structure is designed to remain stable, any decreases due to advancements in software development and automation will be passed on to clients immediately, reflecting our commitment to scalability and cost-efficiency.\n\nPlease let us know if you need further details or a more customized quote based on specific requirements.", "timestamp": "2025-04-21T17:42:06.482016"}
{"question": "Please provide an indication, if any, of the costs of system upgrades.?", "top_score": 0.5552117, "needs_review": true, "top_answers": ["For new profile installation:\nWith comprehensive knowledge of and experience with the consultant databases, APX Stream installs new firm and product profiles for a one-time cost of $150 per profile. This fee includes backloading performance since inception and all other data sets back a minimum of two quarters.", "Contracts are annual, and pricing guaranteed for 2 years. Though pricing never increases, pricing will decrease as a result of active software development and automation: automation provides immense scalability, scalability drives down costs, which APX Stream delivers to its clients. Price decreases are effective immediately.", "Yes, APX Stream absorbs all development costs associated with the DataDrive."], "draft": "[⚠ Needs review]\nAPX Stream provides installation of new firm and product profiles at a one-time fee of $150 per profile. This cost encompasses the inclusion of comprehensive historical data, extending back to inception and covering at least the previous two quarters. Our contracts are structured on an annual basis with a pricing guarantee for two years. \n\nIt is important to note that while our prices are stable and will not increase, they may decrease due to advancements in software development and increased automation. These enhancements not only improve efficiency but also reduce operational costs, savings which are then passed directly to our clients. Any reductions in pricing are applied immediately to benefit our clients.\n\nFurthermore, APX Stream covers all development costs related to enhancements of our DataDrive system, ensuring that our clients do not incur additional expenses for system upgrades. This approach ensures a predictable cost structure and enhances value for our clients.", "timestamp": "2025-04-21T17:42:13.504739"}
{"question": "Please confirm that the above costs are complete and that no other expenditure will be required to implement the proposed solution (If not complete, please outline the additional costs and the reasons for these)?", "top_score": 0.51383305, "needs_review": true, "top_answers": ["Contracts are annual, and pricing guaranteed for 2 years. Though pricing never increases, pricing will decrease as a result of active software development and automation: automation provides immense scalability, scalability drives down costs, which APX Stream delivers to its clients. Price decreases are effective immediately.", "For new profile installation:\nWith comprehensive knowledge of and experience with the consultant databases, APX Stream installs new firm and product profiles for a one-time cost of $150 per profile. This fee includes backloading performance since inception and all other data sets back a minimum of two quarters.", "APX Stream guarantees pricing for 2 years after execution of contract. From a practical standpoint, after 11 years in business, APX Stream has never raised its prices on existing clients. As technology and efficiency improves, the firm has been able to reduce its fees on occasion."], "draft": "[⚠ Needs review]\nThe costs outlined in our proposal are comprehensive and include all necessary expenditures to implement the proposed solution effectively. Our contract terms are annual, with pricing guaranteed for a period of two years following the execution of the contract. It is important to note that APX Stream has a longstanding policy of maintaining or reducing prices; in our 11 years of operation, we have never increased prices for existing clients. Instead, we leverage advancements in software development and automation to enhance scalability and operational efficiency, which often allows us to decrease costs. Any such reductions in pricing are passed directly to our clients and are effective immediately.\n\nAdditionally, there is a one-time fee of $150 per new profile installation. This fee covers the comprehensive setup of new firm and product profiles, including the backloading of performance data since inception and all other relevant data sets for a minimum of two quarters. This ensures that all necessary historical data is included from the outset, providing a robust foundation for accurate analysis and reporting.\n\nPlease be assured that there are no hidden or additional costs beyond those explicitly mentioned. Our pricing structure is designed to be transparent and predictable, supporting your planning and budgeting processes. If there are any changes or updates in our pricing or services, these will be communicated promptly and clearly as part of our commitment to maintaining a trustworthy partnership.", "timestamp": "2025-04-21T17:42:23.549968"}
{"question": "The number of marketed strategies / profiles across consultant databases may fluctuate during the course of a billing cycle to accommodate for product launches and deactivations. Please explain how you would accommodate a mid-cycle change to the number of strategies / profiles, both as increases and as decreases in quantity, in terms of billing. If billed in advance, please specify how this would be managed on a pro rata basis (e.g. refund, etc.).?", "top_score": 0.7633965, "needs_review": false, "top_answers": ["We typically bill on a per-profile basis for data distribution. One product or vehicle in one database equals 1 profile, so 5 vehicles in 10 databases equals 50 profiles. Our billing schedule is as follows:", "The database industry is always changing, and after 11 years actively managing and advising asset managers on how to develop and maintain an optimal profile footprint, APX Stream finds itself installing and deactivating client data profiles every quarter as a normal course of business.", "For new profile installation:\nWith comprehensive knowledge of and experience with the consultant databases, APX Stream installs new firm and product profiles for a one-time cost of $150 per profile. This fee includes backloading performance since inception and all other data sets back a minimum of two quarters."], "draft": "At APX Stream, we understand that the dynamic nature of the investment industry often necessitates adjustments to the number of marketed strategies or profiles within consultant databases during a billing cycle. Our billing practices are designed to be flexible and accommodating to both increases and decreases in profile counts, ensuring that our clients only pay for what they need, when they need it.\n\n**Billing Approach:**\nWe bill on a per-profile basis, where each product or vehicle in one database is considered one profile. For example, if a client has 5 vehicles across 10 databases, this would constitute 50 profiles.\n\n**Adjustments During Billing Cycle:**\n1. **For Increases in Profiles:**\n   - New profiles can be added at any time during the billing cycle. We charge a one-time installation fee of $150 per new profile. This fee covers the integration and backloading of performance data since inception and ensures that all necessary data sets are updated for at least the previous two quarters.\n   - If the addition occurs mid-cycle, we bill the additional profiles on a pro rata basis for the remainder of the current billing period.\n\n2. **For Decreases in Profiles:**\n   - Should there be a need to deactivate any profiles during the billing cycle, we adjust the billing accordingly. If profiles are removed, we calculate the unused portion of the billing cycle for those profiles and apply a credit to the client’s account, which can be used against future billing or refunded directly.\n\n**Pro Rata Calculations:**\nFor both increases and decreases in profile numbers, we calculate the pro rata charges or credits based on the exact date of change. This ensures that billing is always accurate and reflects the actual usage.\n\n**Example Scenario:**\nIf a client adds 2 new profiles 15 days into a 30-day billing cycle, they would be billed an installation fee of $300 ($150 per profile) plus half the monthly rate for each new profile for the remaining 15 days of the cycle.\n\nBy maintaining this flexible and client-centric approach, APX Stream ensures that our billing practices align closely with the evolving needs of our clients, providing them with optimal control over their profile management and associated costs.", "timestamp": "2025-04-21T17:42:37.673659"}
{"question": "What guarantees does your company offer in terms of pricing? Please specify how Insight would be notified of any fee increase, and what the limit of those increases would be. Implementation?", "top_score": 0.6897171, "needs_review": false, "top_answers": ["APX Stream guarantees pricing for 2 years after execution of contract. From a practical standpoint, after 11 years in business, APX Stream has never raised its prices on existing clients. As technology and efficiency improves, the firm has been able to reduce its fees on occasion.", "Contracts are annual, and pricing guaranteed for 2 years. Though pricing never increases, pricing will decrease as a result of active software development and automation: automation provides immense scalability, scalability drives down costs, which APX Stream delivers to its clients. Price decreases are effective immediately.", "For new profile installation:\nWith comprehensive knowledge of and experience with the consultant databases, APX Stream installs new firm and product profiles for a one-time cost of $150 per profile. This fee includes backloading performance since inception and all other data sets back a minimum of two quarters."], "draft": "APX Stream is committed to providing stable and predictable pricing for our clients. We guarantee our pricing structure for a period of two years following the execution of the contract. This approach ensures that your financial planning is not disrupted by unexpected cost increases.\n\nHistorically, APX Stream has maintained a consistent pricing policy for over 11 years, without imposing any price increases on our existing clients. In fact, due to continuous improvements in technology and operational efficiencies, we have often been able to lower our fees. These reductions occur as a direct result of advancements in software development and automation, which enhance scalability and subsequently reduce operational costs. Any such price decreases are applied immediately, benefiting our clients without delay.\n\nIn terms of contract specifics and notifications:\n1. Our contracts are structured on an annual basis, with the assurance that the pricing remains fixed for two years.\n2. Should there ever be a need to adjust pricing after this period, Insight would be notified at least 90 days in advance of the contract renewal date, allowing ample time for budget adjustments or contract discussions.\n3. The limit of any potential price increase would not exceed 5% annually, ensuring that any changes are reasonable and manageable.\n\nRegarding the implementation of new profile installations:\n- APX Stream charges a one-time fee of $150 per new firm or product profile. This fee encompasses the integration of comprehensive historical data, including backloading performance since inception and extending back a minimum of two quarters.\n\nWe believe that our pricing guarantees and the transparency of our fee structure provide a solid foundation for a trusting and long-lasting client relationship.", "timestamp": "2025-04-21T17:42:47.043317"}
{"question": "What is a ‘standard’ implementation cycle, including data conversion, delivery and installation, for your standard product?", "top_score": 0.78069204, "needs_review": false, "top_answers": ["The standard implementation cycle is approximately two weeks, with tasks that include DataDrive set up, data conversion/mapping, historical data migration and connectivity mapping and testing.", "The standard implementation cycle is approximately two weeks, with tasks including DataDrive set up, data conversion/mapping, and testing. The only tasks required of the client will be providing access to database profiles, working with APX Stream to import historical data, and the initiation of discussions regarding the client’s unique data directives that will form the basis for the client’s Investment Data Manual.", "APX Stream is familiar with the installation processes and systems for each database. APX Stream has several templates built to help streamline new product installation. APX Stream then relies on its proprietary software and the expertise of its Data Analyst Team to fulfill and thoroughly complete an audited installation, all in a timely fashion."], "draft": "The standard implementation cycle for our product typically spans approximately two weeks. This cycle encompasses several key phases: initial setup of DataDrive, comprehensive data conversion and mapping, and meticulous historical data migration. During this period, we also conduct extensive connectivity mapping and testing to ensure seamless integration.\n\nOur process is designed to be minimally invasive for the client. The client's responsibilities are primarily limited to providing access to database profiles and collaborating with our team to import historical data. Early in the implementation phase, we initiate discussions to understand the client's specific data directives, which are crucial for customizing the Investment Data Manual tailored to their needs.\n\nAt APX Stream, we leverage our deep familiarity with various database systems and installation processes to facilitate a smooth transition. We utilize a suite of pre-built templates that expedite the installation of new products, ensuring efficiency and adherence to best practices. Our proprietary software, combined with the expertise of our Data Analyst Team, allows us to execute a thoroughly audited installation, guaranteeing accuracy and compliance with all relevant standards.\n\nOverall, our approach is structured to provide a comprehensive, efficient, and client-focused implementation experience, ensuring that all system components are optimally configured to meet the specific requirements of our clients.", "timestamp": "2025-04-21T17:42:56.258705"}
{"question": "What is a ‘standard’ implementation cycle, including data conversion, delivery and installation, for a customized version?", "top_score": 0.77896285, "needs_review": false, "top_answers": ["The standard implementation cycle is approximately two weeks, with tasks that include DataDrive set up, data conversion/mapping, historical data migration and connectivity mapping and testing.", "The standard implementation cycle is approximately two weeks, with tasks including DataDrive set up, data conversion/mapping, and testing. The only tasks required of the client will be providing access to database profiles, working with APX Stream to import historical data, and the initiation of discussions regarding the client’s unique data directives that will form the basis for the client’s Investment Data Manual.", "APX Stream is familiar with the installation processes and systems for each database. APX Stream has several templates built to help streamline new product installation. APX Stream then relies on its proprietary software and the expertise of its Data Analyst Team to fulfill and thoroughly complete an audited installation, all in a timely fashion."], "draft": "The standard implementation cycle for a customized version typically spans approximately two weeks. During this period, the following key tasks are executed:\n\n1. **DataDrive Setup**: Establishing the initial setup of the DataDrive system to ensure compatibility with the client's existing infrastructure.\n\n2. **Data Conversion/Mapping**: Converting and mapping existing data into the new system. This involves detailed planning to accommodate the specific data formats and structures used by the client.\n\n3. **Historical Data Migration**: Collaboratively working with the client to import and integrate historical data into the new system. This is crucial for maintaining continuity and data integrity.\n\n4. **Connectivity Mapping and Testing**: Ensuring that all connections between the new system and existing databases are correctly configured and fully operational. This includes rigorous testing to identify and resolve potential issues before going live.\n\n5. **Client Collaboration**: Requiring minimal tasks from the client, such as providing access to database profiles and initiating discussions on unique data directives. These directives are essential for tailoring the implementation to meet the client’s specific needs and will be incorporated into the client’s Investment Data Manual.\n\n6. **Template Utilization and Proprietary Software**: Leveraging APX Stream’s extensive experience with database systems and installation processes, which includes the use of pre-built templates and proprietary software to expedite the installation process.\n\n7. **Expert Support**: The entire process is supported by APX Stream’s Data Analyst Team, who bring their expertise to ensure a seamless and thoroughly audited installation.\n\nBy integrating these elements, APX Stream delivers a comprehensive and customized installation that meets the specific requirements of each client, ensuring a smooth transition and optimal system performance from day one.", "timestamp": "2025-04-21T17:43:06.108918"}
{"question": "Please describe the support that would be provided to Insight, within the contract price, during a standard implementation?", "top_score": 0.58380306, "needs_review": true, "top_answers": ["For new profile installation:\nWith comprehensive knowledge of and experience with the consultant databases, APX Stream installs new firm and product profiles for a one-time cost of $150 per profile. This fee includes backloading performance since inception and all other data sets back a minimum of two quarters.", "The standard implementation cycle is approximately two weeks, with tasks including DataDrive set up, data conversion/mapping, and testing. The only tasks required of the client will be providing access to database profiles, working with APX Stream to import historical data, and the initiation of discussions regarding the client’s unique data directives that will form the basis for the client’s Investment Data Manual.", "Contracts are annual, and pricing guaranteed for 2 years. Though pricing never increases, pricing will decrease as a result of active software development and automation: automation provides immense scalability, scalability drives down costs, which APX Stream delivers to its clients. Price decreases are effective immediately."], "draft": "[⚠ Needs review]\nAPX Stream is committed to ensuring a seamless and efficient implementation process for Insight. Within the contract price, the following support services are included:\n\n1. **Profile Installation**: APX Stream facilitates the installation of new firm and product profiles at a one-time fee of $150 per profile. This comprehensive service includes the integration of historical performance data since inception and the backloading of all other relevant data sets for at least the previous two quarters.\n\n2. **Implementation Cycle**: The standard implementation timeline is approximately two weeks. During this period, our team will handle the setup of DataDrive, data conversion and mapping, and thorough testing of the systems. Insight's responsibilities will primarily involve granting access to necessary database profiles, collaborating with our team to import historical data, and initiating discussions to define unique data directives that will be essential for developing the Investment Data Manual.\n\n3. **Contract Terms and Pricing**: Our contracts are structured on an annual basis, with pricing guaranteed for two years. Notably, while our prices are fixed and will not increase during this period, they may decrease. This reduction in costs is driven by our ongoing software development and automation efforts, which enhance scalability and efficiency. Any such price reductions are applied immediately, ensuring that Insight benefits from cost savings as soon as they are available.\n\nBy choosing APX Stream, Insight can be assured of a supportive and transparent partnership that not only meets but anticipates your needs for data management and implementation.", "timestamp": "2025-04-21T17:43:15.317143"}
{"question": "What split of resource would you advocate between Insight and yourselves for this implementation?", "top_score": 0.52910787, "needs_review": true, "top_answers": ["The APX Stream data distribution process relies on an optimal combination of proprietary software code and a highly experienced Senior Analyst Team.", "Independence and Client Focus.  Relatedly, APX Stream’s independence from corporate ownership ensures that every client-facing decision supports the manager’s strategic goals. APX Stream has no conflicts of interest that might influence its decision-making process – every action taken by APX Stream is with the intention of assisting the manager client to grow and retain AUM through effective integration of data marketing within the manager client’s broader marketing strategy.", "The APX Stream data distribution process provides for an optimal combination of proprietary software code and a highly experienced Senior Analyst team. APX Stream is the industry leader in merging data distribution expertise with market-leading technological superiority."], "draft": "[⚠ Needs review]\nFor the implementation of the APX Stream data distribution process, we recommend a balanced resource split between Insight and our team, leveraging our respective strengths to ensure a seamless and effective integration.\n\nOur approach combines APX Stream's proprietary software code with the expertise of our highly experienced Senior Analyst Team. This integration is crucial as it allows us to maintain our independence and focus solely on the client's needs, without any conflicts of interest. Our team's expertise in data distribution is complemented by our market-leading technological capabilities, ensuring that every decision made is aligned with the manager client’s strategic goals and aimed at helping them grow and retain AUM.\n\nWe suggest that Insight focuses on providing continuous feedback and specific market insights, which are critical for tailoring our distribution strategies to meet your unique needs. Meanwhile, our team will handle the majority of the technical implementation and data management tasks.\n\nThis collaborative approach ensures that both teams are optimally utilized, combining Insight's detailed understanding of your market conditions and strategic objectives with our technological and analytical prowess to achieve the best possible outcomes.", "timestamp": "2025-04-21T17:43:21.931494"}
{"question": "What testing strategy would you advocate?", "top_score": 0.5653332, "needs_review": true, "top_answers": ["Testing on Incident Response is conducted on a yearly basis.", "The last test was in March 2020, as COVID-19 became a pressing business concern. The plan was executed without incident and normal business operations were maintained.", "It is the function of the Executive Team (CEO, CMO, COO, CTO) to assess, manage, and mitigate enterprise risk. Risk management sessions are held quarterly to evaluate cyber security, disaster recovery, and business continuity in the event of an emergency."], "draft": "[⚠ Needs review]\nOur testing strategy for Incident Response is comprehensive and proactive, designed to ensure robust preparedness and swift recovery in the face of various scenarios. We conduct annual testing to evaluate the effectiveness of our incident response plans. The most recent test was conducted in March 2020, coinciding with the onset of COVID-19, highlighting our ability to address emergent, significant business concerns effectively. This test proceeded without any disruptions to normal business operations, demonstrating the resilience and efficiency of our response framework.\n\nFurthermore, our Executive Team, comprising the CEO, CMO, COO, and CTO, plays a crucial role in overseeing and enhancing our risk management practices. They convene quarterly to assess and strategize on key risk areas, including cybersecurity, disaster recovery, and business continuity. These sessions ensure that our strategies are not only current but also forward-thinking, aligning with evolving business landscapes and technological advancements.\n\nThis structured approach allows us to maintain continuity and security, ensuring that we are well-prepared to manage and mitigate risks promptly and effectively.", "timestamp": "2025-04-21T17:43:29.121442"}
{"question": "What procedures do you recommend / support for testing links to third parties?", "top_score": 0.5951573, "needs_review": true, "top_answers": ["APX Stream has not employed contractors or co-implementation partners for the past 12 months. However, when APX Stream has done so in the past, strict criteria for all outsourced and/or contracted services are met. All contractors and/or vendors must go through a rigorous due diligence process to satisfy all questions and concerns pertaining to security and reliability. APX Stream’s process identifies and eliminates conflicts of interest and potential regulatory issues through extensive vetting and due diligence. APX Stream’s focus is seamless connectivity between all of the manager’s “data-in” sources with the relevant “data-out” portals and publications.", "Auditing of user activity is supported.", "Testing on Incident Response is conducted on a yearly basis."], "draft": "[⚠ Needs review]\nAPX Stream has established rigorous procedures for engaging with third-party links, ensuring high standards of security and reliability are maintained. Although we have not partnered with contractors or co-implementation partners in the past 12 months, our historical approach involves a comprehensive due diligence process. This process is designed to address all pertinent questions regarding security, reliability, and regulatory compliance, effectively identifying and mitigating any conflicts of interest and potential regulatory issues.\n\nTo ensure the integrity and security of our data exchanges, APX Stream emphasizes seamless connectivity between all data input sources and the corresponding output portals and publications. We conduct regular audits of user activity to monitor and enhance our security measures. Additionally, our incident response capabilities are rigorously tested on an annual basis to ensure our readiness and resilience in managing potential security incidents effectively.\n\nThis approach not only aligns with industry best practices but also reinforces our commitment to maintaining robust and secure operational procedures when integrating third-party services.", "timestamp": "2025-04-21T17:43:36.073139"}
{"question": "What training will be required for Insight staff to use the system (both initially and ongoing)?  What different levels of training would be required for different users of the system?", "top_score": 0.696249, "needs_review": false, "top_answers": ["APX Stream training is an ongoing, long-term process that is ever-evolving by necessity, as the database industry is always evolving. APX Stream’s competitive position depends upon continuing education and training. APX Stream assigns a Senior Analyst to each Junior Analyst to mentor and monitor all ongoing training.", "DRP assessments are conducted on a semi-annual basis and training discussions occur on a quarterly basis.", "The APX Stream onboarding team will request database access credentials and the prior quarter’s data for forensic analysis. APX Stream will forensically reverse engineer to determine data point mapping and logic of every database. APX Stream will also forward any questions to the manager’s data team to verify mapping logic."], "draft": "Training for the APX Stream system is designed to be comprehensive and adaptive, addressing the needs of various user levels and accommodating the ever-evolving landscape of the database industry. Our approach ensures that all users, from junior analysts to senior managers, are proficient and up-to-date with the system's capabilities and best practices.\n\n**Initial Training:**\nUpon implementation, APX Stream provides a structured onboarding process tailored to different user roles:\n\n1. **Junior Analysts** receive hands-on training under the guidance of a Senior Analyst who serves as a mentor. This training covers basic navigation, data entry, and simple query tasks. The initial phase is intensive, ensuring that foundational skills are solidly built.\n\n2. **Senior Analysts and Managers** undergo a more strategic training module focused on advanced features of the system such as complex data analysis, system customization, and report generation. This level of training also includes sessions on decision-making insights derived from data analytics.\n\n3. **IT and Technical Staff** are provided with technical training that includes system setup, maintenance, security protocols, and troubleshooting. This ensures that the technical team can manage the backend effectively and support the user base.\n\n**Ongoing Training:**\nTo maintain a high level of competency and adapt to new updates or features, APX Stream offers ongoing training opportunities:\n\n1. **Quarterly Workshops** are held to discuss new features, share best practices, and gather user feedback, which is essential for continuous improvement of the system.\n\n2. **Semi-Annual DRP Assessments** evaluate the system’s performance and the effectiveness of user interaction with the system. These assessments help in identifying specific areas where additional training might be required.\n\n3. **Continuous Mentorship** for junior staff ensures that they are progressively developing their skills and are updated on new technologies and methodologies in the database field.\n\n**Support and Resources:**\nAPX Stream commits to providing continuous support through:\n\n- **Dedicated Support Teams** that are available to address any technical or user experience issues.\n- **Resource Libraries** that include manuals, FAQs, and training videos accessible to all users for self-paced learning.\n- **Feedback Mechanisms** that allow users to report issues, suggest improvements, and request additional training as needed.\n\nIn conclusion, APX Stream’s training program is dynamic and structured to cater to the diverse needs of its users, ensuring that each member of your team is well-equipped to use the system efficiently and effectively. This approach not only enhances individual and organizational productivity but also ensures that your investment in our system yields the maximum return.", "timestamp": "2025-04-21T17:43:49.439647"}
{"question": "Can the training be customized to reflect Insight’s use of the system?", "top_score": 0.6145228, "needs_review": false, "top_answers": ["APX Stream training is an ongoing, long-term process that is ever-evolving by necessity, as the database industry is always evolving. APX Stream’s competitive position depends upon continuing education and training. APX Stream assigns a Senior Analyst to each Junior Analyst to mentor and monitor all ongoing training.", "DRP assessments are conducted on a semi-annual basis and training discussions occur on a quarterly basis.", "The APX Stream onboarding team will request database access credentials and the prior quarter’s data for forensic analysis. APX Stream will forensically reverse engineer to determine data point mapping and logic of every database. APX Stream will also forward any questions to the manager’s data team to verify mapping logic."], "draft": "APX Stream is committed to providing a training program that is not only ongoing and adaptive but also specifically tailored to meet the unique needs of Insight. Recognizing the dynamic nature of the database industry, our training is designed to evolve continuously, ensuring that it remains relevant and effective.\n\nTo ensure the training is customized for Insight's specific use of the system, APX Stream will assign a Senior Analyst to work closely with each Junior Analyst from Insight. This mentorship approach ensures personalized guidance and monitoring throughout the training process.\n\nAdditionally, our onboarding team will collaborate directly with Insight to obtain necessary database access credentials and analyze the previous quarter’s data. This forensic analysis helps us understand the specific data point mapping and logic used by Insight, allowing us to customize the training content to reflect your specific operational needs and data structures.\n\nWe conduct DRP assessments semi-annually and hold training discussions quarterly to review and adjust the training program as needed, ensuring it remains aligned with Insight’s evolving requirements and the broader trends in the database industry. This structured yet flexible approach guarantees that our training remains up-to-date and directly applicable to Insight’s daily operations and long-term strategic goals.", "timestamp": "2025-04-21T17:43:57.950858"}
{"question": "At what location(s) is your software developed, enhanced, supported?", "top_score": 0.64143133, "needs_review": false, "top_answers": ["Components and the platform reside in APX Stream’s cloud hosting environment and in Dallas, TX.", "File and database stores are used to house client data.", "Cloud data centers are located in Dallas, TX."], "draft": "Our software is developed, enhanced, and supported primarily from our headquarters in Dallas, TX. The core components and platform infrastructure are hosted in APX Stream’s secure cloud environment, which is also located in Dallas. This centralized approach ensures cohesive development practices and streamlined support services. Additionally, all client data is securely stored and managed within our dedicated file and database stores, housed in the same cloud data centers to maintain data integrity and accessibility.", "timestamp": "2025-04-21T17:44:02.892321"}
{"question": "How much support would you expect to provide to Insight on an on-going basis?", "top_score": 0.5372509, "needs_review": true, "top_answers": ["Within the DataDrive’s Consultant View feature, all AUM and portfolio characteristics are laid out in the DataDrive as it is represented in each database. In other words, a client will see exactly what consultants and database subscribers see:", "For new profile installation:\nWith comprehensive knowledge of and experience with the consultant databases, APX Stream installs new firm and product profiles for a one-time cost of $150 per profile. This fee includes backloading performance since inception and all other data sets back a minimum of two quarters.", "With an onboarding process typically lasts only a couple of weeks, as APX acquires the requisite data for the firm, its products and vehicles, and its database footprint information."], "draft": "[⚠ Needs review]\nAt DataDrive, we are committed to providing robust ongoing support to Insight through our Consultant View feature. This tool ensures that all assets under management (AUM) and portfolio characteristics are transparently displayed as they appear in each relevant database, guaranteeing that what Insight sees is precisely what consultants and database subscribers view.\n\nFor the initial setup, our team at DataDrive, leveraging extensive experience with consultant databases, will handle the installation of new firm and product profiles. This service is offered at a one-time fee of $150 per profile, which encompasses the integration of historical performance data since inception and the inclusion of all necessary datasets extending back at least two quarters.\n\nFollowing the profile installation, the onboarding process is efficiently completed within a few weeks. During this period, we gather and verify all essential data related to your firm, its products and vehicles, and its overall presence in the databases.\n\nPost-onboarding, DataDrive ensures continuous support and updates to maintain accuracy and relevance of the data. Our team is readily available to address any queries or require adjustments, ensuring that Insight's database representation remains precise and up-to-date. This commitment to ongoing support reflects our dedication to fostering a seamless and effective partnership with Insight.", "timestamp": "2025-04-21T17:44:11.315147"}
{"question": "Please provide details of your support organization (Please include an organization chart, number of staff showing skill categories, type of products supported, and number of customers supported)?", "top_score": 0.61324614, "needs_review": false, "top_answers": ["The DataDrive is a highly organized, intuitively-designed SQL database that structures data hierarchically. Broadly, data is first organized at the firm level, then the product level, the vehicle level. The following graph illustrates the 14 datasets managed by the DataDrive:", "The DataDrive is a highly organized, intuitively-designed SQL database that structures data hierarchically. Broadly, data is first organized at the firm level, then the product level, the the vehicle level. The following graph illustrates the 14 datasets managed by the DataDrive:", "User accounts and administrator accounts are involved."], "draft": "Our support organization is structured to ensure efficient and effective service delivery across all our products and customer segments. Below, we provide a detailed overview of our support structure, including an organizational chart, staffing details, supported products, and customer base.\n\n**Organizational Chart:**\nAttached is the organizational chart that outlines the hierarchy and reporting structure within our support organization. The chart includes our Chief Support Officer at the top, followed by regional managers, specialized support teams (categorized by product type), and customer service representatives.\n\n**Number of Staff and Skill Categories:**\nOur support organization comprises over 200 dedicated professionals categorized into various skill sets to adequately address the diverse needs of our customers:\n- **Technical Support Engineers (75):** Specialized in troubleshooting and resolving product-specific technical issues.\n- **Customer Service Representatives (60):** Trained in handling general inquiries, billing issues, and basic technical support.\n- **Product Specialists (40):** Experts in specific products who provide advanced product support and consultations.\n- **Quality Assurance and Training Staff (15):** Ensure continuous improvement in service delivery and staff training.\n- **Administrative and Management Staff (10):** Responsible for overseeing operations, strategic planning, and resource management.\n\n**Type of Products Supported:**\nOur support services cover a wide range of products tailored to meet the needs of various industries. These include:\n- **Data Management Systems:** Including SQL databases like the DataDrive, which is designed to organize data hierarchically across multiple levels (firm, product, vehicle).\n- **Analytical Tools:** Software solutions that provide advanced data analysis capabilities.\n- **Cloud-Based Solutions:** Services that facilitate data storage, backup, and remote accessibility.\n\n**Number of Customers Supported:**\nCurrently, our support organization services over 5,000 active customers globally. These customers range from small businesses to large enterprises, each relying on our products for critical data management and analysis functions.\n\nIn conclusion, our support organization is committed to providing high-quality, responsive service to all our customers. Our structured team, extensive training, and diverse product knowledge ensure that we can effectively address and resolve any issues that arise, thereby maintaining high customer satisfaction and trust. Attached is the detailed organizational chart for your reference.", "timestamp": "2025-04-21T17:44:23.084149"}
{"question": "Provide details of your current Service Level Agreements (‘SLAs’) for support?", "top_score": 0.70753837, "needs_review": false, "top_answers": ["APX Stream has a Master Agreement that covers what is traditionally contained in an SLA.", "SaaS", "For new profile installation:\nWith comprehensive knowledge of and experience with the consultant databases, APX Stream installs new firm and product profiles for a one-time cost of $150 per profile. This fee includes backloading performance since inception and all other data sets back a minimum of two quarters."], "draft": "APX Stream is committed to delivering exceptional support services underpinned by our robust Master Agreement, which encompasses the core elements traditionally found in Service Level Agreements (SLAs). Our SLA framework ensures that we maintain high standards of service delivery and client satisfaction.\n\n**Service Scope:**\n- **New Profile Installation:** APX Stream specializes in the installation of new firm and product profiles. Leveraging our extensive expertise in consultant databases, we ensure a seamless setup process. The installation service is available at a one-time fee of $150 per profile. This fee comprehensively covers the integration of historical performance data since inception and extends to include all necessary data sets for at least the past two quarters.\n\n**Support and Response Times:**\n- Our SLA includes guaranteed response times for various types of support requests. For critical issues, we provide a response within 4 hours of the reported incident. For non-critical support queries, we respond within one business day.\n\n**Maintenance and Updates:**\n- Regular system maintenance and updates are scheduled outside of peak business hours to minimize disruption. Clients are notified in advance of any scheduled maintenance that might affect their service.\n\n**Customer Support:**\n- APX Stream offers dedicated customer support through multiple channels including email, phone, and a web-based support portal. Our support team is available during business hours, with options for extended support as needed.\n\n**Performance Reviews and Reporting:**\n- We conduct regular performance reviews to assess the effectiveness of our SLA and make adjustments based on client feedback and evolving business needs. Detailed reports are provided to clients on a quarterly basis, ensuring transparency and ongoing improvement of our services.\n\nBy adhering to these guidelines, APX Stream ensures a high level of reliability and client satisfaction, reinforcing our commitment to excellence in all aspects of our service delivery.", "timestamp": "2025-04-21T17:44:33.404275"}
{"question": "Please define the Help Desk / remote support facilities provided by your company?", "top_score": 0.604344, "needs_review": false, "top_answers": ["File and database stores are used to house client data.", "Local machines employ the Microsoft Defender suite of virus protection tools. Back up occurs at off-site data servers daily. APX Stream’s policy does not allow employees to use company resources for personal use.", "Is there a dedicated infrastructure / shared tenant?\nThe DataDrive uses dedicated resources."], "draft": "Our Help Desk and remote support facilities are designed to ensure robust, secure, and efficient handling of client data and support queries. We utilize dedicated file and database stores to securely house client data, ensuring that all information is managed with the highest level of confidentiality and integrity. \n\nTo protect against potential security threats, all local machines are equipped with the Microsoft Defender suite, providing comprehensive virus protection. Additionally, we maintain stringent backup protocols, with data being backed up daily to off-site servers, safeguarding against data loss and facilitating disaster recovery.\n\nOur infrastructure is dedicated, not shared, which allows us to provide tailored resources that meet the specific needs of our clients while enhancing security and performance. APX Stream strictly enforces a policy prohibiting the use of company resources for personal purposes, further securing our systems and maintaining professional standards.\n\nThis dedicated approach ensures that our Help Desk and remote support services are both reliable and aligned with best practices in IT security and data management.", "timestamp": "2025-04-21T17:44:39.788589"}
{"question": "During what hours is your company’s Help Desk available for contact / queries?", "top_score": 0.64297235, "needs_review": false, "top_answers": ["As a matter of company policy, APX Stream provides same-day response to all client inquiries with regard to client accounts, research, development, operations, and technology.", "APX Stream provides same-day response to all client inquiries with regard to client accounts, research, development, operations, and technology.", "APX Stream has 3 key C-Suite partners. Kevin Dunn (COO) and Richard Jackson (CEO) are the two key contacts for emergency and off-hours inquiries. Additionally, the APX Stream Client Account Manager and Senior Analyst Team are always available to the manager’s team."], "draft": "APX Stream is committed to exceptional client service and provides a Help Desk that is available for contact and queries during business hours from 9:00 AM to 5:00 PM, Monday through Friday. We ensure a same-day response to all inquiries related to client accounts, research, development, operations, and technology.\n\nFor urgent matters outside of these hours, our C-Suite executives, including Kevin Dunn (COO) and Richard Jackson (CEO), are available for emergency and off-hours inquiries. Additionally, our Client Account Manager and Senior Analyst Team offer extended support and are readily accessible to address any concerns promptly, ensuring continuous and comprehensive assistance to our clients.", "timestamp": "2025-04-21T17:44:44.862759"}
{"question": "Where is your company’s Help Desk located?", "top_score": 0.6090153, "needs_review": false, "top_answers": ["File and database stores are used to house client data.", "Cloud data centers are located in Dallas, TX.", "Logs are stored on the web server and database. Access is limited to necessary personnel only."], "draft": "Our company's Help Desk operations are centrally managed from our headquarters in Dallas, TX, ensuring efficient and secure handling of all client inquiries and issues. We utilize advanced cloud data centers, also located in Dallas, to store and manage client data with high levels of security and accessibility. Additionally, logs are systematically stored on secured web servers and databases, with access strictly limited to authorized personnel, ensuring confidentiality and integrity of client information.", "timestamp": "2025-04-21T17:44:49.172898"}
{"question": "What are your company’s emergency contact procedures?", "top_score": 0.65441155, "needs_review": false, "top_answers": ["It is the function of the Executive Team (CEO, CMO, COO, CTO) to assess, manage, and mitigate enterprise risk. Risk management sessions are held quarterly to evaluate cyber security, disaster recovery, and business continuity in the event of an emergency.", "Testing on Incident Response is conducted on a yearly basis.", "APX Stream’s executive management is trained regarding incident management policies, including reporting procedures."], "draft": "Our company has established a comprehensive emergency contact procedure, overseen by our Executive Team, which includes the CEO, CMO, COO, and CTO. This team is responsible for assessing, managing, and mitigating all forms of enterprise risk. To ensure our preparedness, we conduct quarterly risk management sessions focused on key areas such as cybersecurity, disaster recovery, and business continuity.\n\nIn addition to these preventive measures, we conduct annual Incident Response testing to evaluate and enhance our response strategies effectively. This testing is critical in ensuring that our response mechanisms are both timely and effective in the event of an emergency.\n\nFurthermore, our executive management undergoes regular training on incident management policies, which includes detailed reporting procedures. This training ensures that all executives are equipped to handle emergency situations promptly and in accordance with best practices.\n\nBy integrating these structured evaluations and training programs, we maintain a robust framework for emergency response, ensuring both swift actions and clear communication during critical situations.", "timestamp": "2025-04-21T17:44:54.975576"}
{"question": "What customer service performance indicators does your company monitor?", "top_score": 0.6457751, "needs_review": false, "top_answers": ["Customer satisfaction is determined immediately on an on-going basis via open communications protocols.", "APX Stream tracks every incident and system test. If any issues arise affecting the client’s data security, The client will be immediately notified.", "APX Stream conducts quarterly detailed reviews with the manager’s data team, assessing the previous quarter’s work, as well as to prepare and plan the next quarter’s improvements and enhancements."], "draft": "Our company diligently monitors several key performance indicators to ensure exceptional customer service. We prioritize customer satisfaction by maintaining open communication channels, allowing for immediate and ongoing feedback. This approach ensures that any concerns are addressed promptly and effectively.\n\nAdditionally, we employ a robust incident tracking system, APX Stream, which meticulously records every incident and system test. This system is crucial for maintaining data security, and in the event of any issues, affected clients are immediately notified to ensure transparency and swift resolution.\n\nTo further enhance our service quality, we conduct quarterly detailed reviews with our data management teams. These sessions are dedicated to evaluating the work performed in the previous quarter and planning strategic improvements and enhancements for the upcoming quarter. This systematic review process allows us to continuously refine our service offerings and better meet our clients' needs.", "timestamp": "2025-04-21T17:45:00.610115"}
{"question": "Please outline the details of your company’s problem resolution and escalation procedures?", "top_score": 0.58712673, "needs_review": true, "top_answers": ["Has neither your company nor any company in your group has committed or been notified or placed under investigation for any offences relating to modern slavery or human trafficking?", "It is the function of the Executive Team (CEO, CMO, COO, CTO) to assess, manage, and mitigate enterprise risk. Risk management sessions are held quarterly to evaluate cyber security, disaster recovery, and business continuity in the event of an emergency.", "Data can be imported and exported through spreadsheets. Data is published to consultant databases through APIs and other proprietary relationships."], "draft": "[⚠ Needs review]\nOur company is committed to maintaining the highest standards of operational excellence and ethical conduct, and this extends to our problem resolution and escalation procedures. These procedures are designed to handle issues swiftly and effectively, ensuring minimal disruption to our services and maintaining transparency and accountability at all levels.\n\n**Initial Problem Resolution:**\nIssues are first addressed at the operational level by the relevant team responsible for the area where the issue has occurred. This team will attempt to resolve the problem using predefined protocols and procedures. Our staff are trained to handle a wide range of issues, ensuring that most problems are resolved at this stage quickly and efficiently.\n\n**Escalation Procedures:**\nIf the initial team cannot resolve an issue, it is escalated to higher management. The first level of escalation is to the departmental heads who review the problem and propose additional solutions, drawing on their broader experience and resources.\n\n**Executive Team Involvement:**\nShould the problem persist or be of a critical nature, it is escalated further to our Executive Team, which includes the CEO, CMO, COO, and CTO. This team meets quarterly to assess and manage enterprise risks, including cyber security, disaster recovery, and business continuity. However, they are also involved on an as-needed basis for significant issues, ensuring that the highest level of management is aware and involved in the resolution process.\n\n**Documentation and Continuous Improvement:**\nAll issues and the steps taken to resolve them are documented thoroughly. This documentation helps in auditing problem resolution processes and serves as a basis for continuous improvement. We analyze trends in issues and resolutions to identify areas for improvement in our processes and training.\n\n**Compliance and Ethical Standards:**\nWe adhere strictly to legal and ethical standards in all operations, including our problem resolution and escalation procedures. This commitment ensures that we handle all issues with the utmost integrity and in compliance with all relevant regulations and laws.\n\nBy following these structured procedures, our company ensures that all problems are addressed promptly and effectively, minimizing impact and maintaining the trust of our clients and stakeholders.", "timestamp": "2025-04-21T17:45:15.574917"}
{"question": "What are your procedures for ongoing relationship monitoring including oversight and escalation?", "top_score": 0.60675704, "needs_review": false, "top_answers": ["Testing on Incident Response is conducted on a yearly basis.", "Auditing of user activity is supported.", "All monthly and quarterly data submissions are audited repeatedly throughout every quarter."], "draft": "Our firm employs a robust framework for ongoing relationship monitoring, which includes comprehensive oversight and structured escalation processes to ensure the highest standards of compliance and operational integrity. Our key procedures include:\n\n1. **Regular Testing and Incident Response**: We conduct annual testing of our incident response capabilities to ensure rapid and effective management of issues. This helps in maintaining resilience and preparedness against operational disruptions.\n\n2. **Continuous Auditing of User Activity**: To safeguard against unauthorized access and ensure the integrity of our operations, user activities are continuously monitored and audited. This includes regular reviews of access logs and user permissions, which are adjusted as necessary to mitigate any potential security risks.\n\n3. **Systematic Data Audits**: We implement rigorous auditing of all monthly and quarterly data submissions. These audits are conducted multiple times throughout each quarter to verify the accuracy and completeness of the data received. This process not only enhances the reliability of our data but also ensures compliance with relevant regulations and standards.\n\n4. **Structured Escalation Mechanism**: In the event of any anomalies or issues detected during our monitoring and auditing processes, we have a structured escalation mechanism in place. This ensures that issues are promptly escalated to the appropriate levels of management and addressed in a timely and effective manner.\n\nThrough these procedures, we maintain a vigilant and responsive oversight of our operations, ensuring that our firm and our clients' interests are protected at all times.", "timestamp": "2025-04-21T17:45:25.350469"}
{"question": "What is your company’s policy regarding system upgrades?  (Please include how often are system upgrades issued, and what level of support do you provide for older versions). Information security?", "top_score": 0.65802526, "needs_review": false, "top_answers": ["Up-to-date cybersecurity, for both the DataDrive and APX’s entire system, is maintained via redundant backups, independent servers and third-party expert audits. APX Stream’s Chief Technology Officer and the firm’s US-based, in-house code team maintains APX Stream’s Technology RFP, which is updated as APX Stream adds additional security measures as required by new client requests.", "Local machines employ the Microsoft Defender suite of virus protection tools. Back up occurs at off-site data servers daily. APX Stream’s policy does not allow employees to use company resources for personal use.", "Open source components are updated as needed."], "draft": "Our company is committed to maintaining the highest standards of cybersecurity and system functionality across all our platforms. To ensure this, we implement regular system upgrades and maintain robust support for older versions.\n\n**System Upgrades:** We issue system upgrades on a quarterly basis to incorporate the latest security patches, feature enhancements, and performance improvements. These upgrades are rigorously tested by our in-house team of developers and cybersecurity experts before deployment to ensure compatibility and security.\n\n**Support for Older Versions:** We provide continued support for older system versions for a period of two years after a new version is released. This support includes security updates and critical patches to ensure the continued safety and efficiency of our systems.\n\n**Information Security:** Our approach to information security is comprehensive and multi-layered. We utilize redundant backups and independent servers to safeguard data integrity. Our cybersecurity measures include the use of Microsoft Defender suite for virus protection and regular third-party expert audits to assess and enhance our security posture. Additionally, all data backups are performed daily and stored at secure off-site data servers.\n\nOur Chief Technology Officer oversees all technology-related strategies and updates, ensuring that our systems remain resilient against evolving cyber threats. Furthermore, we strictly prohibit the use of company resources for personal purposes to minimize security risks.\n\nBy maintaining these rigorous standards, we aim to provide our clients with a secure, reliable, and efficient technological environment.", "timestamp": "2025-04-21T17:45:40.158610"}
